<template>
  <div ref="playerRef"></div>
</template>

<script lang="ts">
import APlayer from "aplayer";
import "../../css/APlayer.min.css";
import { PropType } from "@vue/runtime-core";
import {
  defineComponent,
  nextTick,
  onBeforeUnmount,
  onMounted,
  reactive,
  ref,
  toRefs,
} from "vue";
import { Audio, getAudioList, getSongUrl } from "@/api/music";
export default defineComponent({
  props: {
    // 开启吸底模式
    fixed: {
      type: Boolean as PropType<boolean>,
      default: true,
    },
    // 开启迷你模式
    mini: {
      type: Boolean as PropType<boolean>,
      default: true,
    },
    // 音频自动播放
    autoplay: {
      type: Boolean as PropType<boolean>,
      default: false,
    },
    // 主题色
    theme: {
      type: String as PropType<string>,
      default: "rgba(255,255,255,0.2)",
    },
    // 音频循环播放
    loop: {
      type: String as PropType<"all" | "one" | "none">,
      default: "all",
    },
    // 音频循环顺序
    order: {
      type: String as PropType<"list" | "random">,
      default: "random",
    },
    // 预加载
    preload: {
      type: String as PropType<"auto" | "metadata" | "none">,
      default: "auto",
    },
    // 默认音量
    volume: {
      type: Number as PropType<number>,
      default: 0.7,
      validator: (value: Number) => {
        return value >= 0 && value <= 1;
      },
    },
    // 互斥，阻止多个播放器同时播放，当前播放器播放时暂停其他播放器
    mutex: {
      type: Boolean as PropType<boolean>,
      default: true,
    },
    // 传递歌词方式
    lrcType: {
      type: Number as PropType<number>,
      default: 1,
    },
    // 列表是否默认折叠
    listFolded: {
      type: Boolean as PropType<boolean>,
      default: true,
    },
    // 列表最大高度
    listMaxHeight: {
      type: String as PropType<string>,
      default: "263px",
    },
    // 存储播放器设置的 localStorage key
    storageName: {
      type: String as PropType<string>,
      default: "aplayer-setting",
    },
    // 歌曲服务器(netease-网易云, tencent-qq音乐, kugou-酷狗, xiami-小米音乐, baidu-百度音乐)
    songServer: {
      type: String as PropType<
        "netease" | "tencent" | "kugou" | "xiami" | "baidu"
      >,
      default: "netease",
    },
    // 播放类型(song-歌曲, playlist-播放列表, album-专辑, search-搜索, artist-艺术家)
    songType: {
      type: String as PropType<string>,
      default: "playlist",
    },
    // 歌的id
    songId: {
      type: String as PropType<string>,
      default: "19723756",
    },
  },
  setup(props: any) {
    const playerRef = ref();
    let ap: APlayer;
    const state = reactive({
      audioList: [],
      myMusicList: [],
    });

    const methods = {
      init() {
        if (ap) {
          ap.destroy();
        }
        ap = new APlayer({
          container: playerRef.value,
          fixed: props.fixed,
          mini: props.mini,
          autoplay: props.autoplay,
          theme: props.theme,
          loop: props.loop,
          order: props.order,
          preload: props.preload,
          volume: props.volume,
          mutex: props.mutex,
          lrcType: props.lrcType,
          listFolded: props.listFolded,
          listMaxHeight: props.listMaxHeight,
          storageName: props.storageName,
          audio: state.audioList,
        });
        ap.list.switch(0);
        // console.log(ap.list.audios);
      },
      watchLocalStorage() {
        // 监听localStorage.setItem
        window.addEventListener("setItemEvent", (e: any) => {
          // 添加单曲到歌单
          if (e.key === "audio") {
            let oldIndex = ap.list.audios.length;
            let music = JSON.parse(e.newValue);
            for (let m = 0; m < music.length; m++) {
              // 移除存在的歌曲
              for (let i = ap.list.audios.length - 1; i >= 0; i--) {
                if (
                  ap.list.audios[i].author === music[m].author &&
                  ap.list.audios[i].title === music[m].title
                ) {
                  ap.list.audios[i].url = music[m].url;
                  ap.list.audios[i].pic = music[m].pic;
                  ap.list.audios[i].lrc = music[m].lrc;
                  ap.list.remove(i);
                }
              }
              // 添加歌曲
              ap.list.add(
                new Audio(
                  // 歌手
                  music[m].author,
                  // 歌名
                  music[m].title,
                  // 播放地址
                  music[m].url,
                  // 图片地址
                  music[m].pic,
                  // 歌词地址
                  music[m].lrc
                )
              );
            }
            ap.list.switch(
              oldIndex < ap.list.audios.length
                ? oldIndex
                : ap.list.audios.length - 1
            );
            ap.play();
          }
          // 替换当前播放列表
          if (e.key === "audioList") {
            ap.list.clear();
            ap.list.add(
              JSON.parse(e.newValue).map(
                (music: any) =>
                  new Audio(
                    // 歌手
                    music.author,
                    // 歌名
                    music.title,
                    // 播放地址
                    music.url,
                    // 图片地址
                    music.pic,
                    // 歌词地址
                    music.lrc
                  )
              )
            );
            ap.list.switch(0);
            ap.play();
          }
        });
      },
      async setMyMusicList() {
        state.myMusicList = [
          {
            id: 1303027499,
            author: "棱镜乐队",
            title: "总有一天你会出现在我身边",
            url: "https://shuaigang.top/gsg/music/zyytnhcxzwsb.mp3",
            pic: "https://p2.music.126.net/RfUHXkanpxImcaGqFNWBeA==/109951163598901405.jpg",
            lrc: "[00:00.00] 作词 : 高原/陈恒冠\n[00:01.00] 作曲 : 陈恒冠\n[00:02.10]编曲：陈恒冠\n[00:06.97]\n[00:13.58]从前我的另一边\n[00:18.14]通往凌晨的街\n[00:21.44]空无一人的世界\n[00:26.89]行影匆匆这些年\n[00:31.23]期望从未破灭\n[00:34.69]默不作响的时间\n[00:40.73]最好的人注定会到身边\n[00:47.23]孤注一掷的执念\n[00:53.84]我终将看到你身影逆光 出现\n[01:06.64]等这一切 都被你了解 十指错落相牵\n[01:20.29]跨越时间 再没有分别 携手走过明天\n[01:45.78]雨后路人化鱼鲔\n[01:50.29]欢愉游跃摇曳\n[01:52.89]灿烂一抱的世界\n[01:59.62]光芒捧起你的脸\n[02:03.33]我飞在云层间\n[02:06.63]狂奔向你不停歇\n[02:12.78]你说最好的人会到身边\n[02:19.33]此刻我也这样想\n[02:25.94]你终将看到我最美模样 出现\n[02:38.89]等这一切 都被你了解 十指错落相牵\n[02:52.19]跨越时间 再没有分别 携手走过明天\n[03:05.35]总会有些 幸运会出现 我等待这一天\n[03:18.59]总有艰险 哪怕是谎言 我等待你出现\n[03:31.73]等这一切 都被你了解 十指错落相牵\n[03:44.88]跨越时间 再没有分别 携手走过明天\n[03:57.70]等这一切 都被你了解 十指错落相牵\n[04:11.25]跨越时间 总会有一天 你出现我身边\n[04:12.25]\n[04:13.25]混音：陈恒家\n[04:14.25]封面：水吉\n[04:15.25]监制：1991与她\n",
          },
          {
            id: 1366216050,
            author: "棱镜乐队",
            title: "这是我一生中最勇敢的瞬间",
            url: "https://shuaigang.top/gsg/music/zswyszzygdsj.mp3",
            pic: "https://p2.music.126.net/ysc2LpByNXmzAfz9rRVwYg==/109951165267741474.jpg",
            lrc: "[00:00.000] 作词 : 高原\n[00:01.000] 作曲 : 陈恒家\n[00:02.000] 编曲 : 陈恒家\n[00:03.000] 人声 : 陈恒冠\n[00:04.000] 和声 : 陈恒冠 陈恒家\n[00:05.000] 鼓 : Jordan Bertrand\n[00:06.000] 录音 : 陈恒家\n[00:07.000] 混音 : 陈恒家\n[00:08.000] 母带 : 陈恒家\n[00:09.000] 监制 : 1991与她\n[00:15.360]女声采样：咕噜咕噜\n[00:21.360]我本打算去流浪\n[00:25.610]把所有的回望都交给夕阳\n[00:31.960]风是空港 雨是牧场\n[00:36.310]我陷入万里无云的海洋\n[00:41.960]\n[00:42.710]我并不渴望远方\n[00:46.960]只想找到一个可爱的地方\n[00:53.210]跨过飞杭 穿过弄堂\n[00:57.660]你站在我始料未及的小巷\n[01:05.959]\n[01:06.659]这是我一生中最勇敢的瞬间\n[01:10.909]远在世界尽头的你站在我面前\n[01:16.959]这是我一生中最勇敢的瞬间\n[01:21.659]我的眼中藏着星点嘴角有弧线\n[01:27.709]这是我一生中最勇敢的瞬间\n[01:32.310]你是黎明地平线是我永恒的终点\n[01:38.310]我想把时间揉成碎片捧在我手心\n[01:44.410]\n[01:45.610]明天周六可以把我们一起出去玩 改成我们去约会吗\n[01:51.060]\n[02:13.360]我并不渴望远方\n[02:17.610]只想找到一个可爱的地方\n[02:24.009]跨过飞杭 穿过弄堂\n[02:28.259]你站在我始料未及的小巷\n[02:34.610]\n[02:36.910]这是我一生中最勇敢的瞬间\n[02:41.610]远在世界尽头的你站在我面前\n[02:47.560]这是我一生中最勇敢的瞬间\n[02:52.259]我的眼中藏着星点嘴角有弧线\n[02:58.259]这是我一生中最勇敢的瞬间\n[03:02.960]你是黎明地平线是我永恒的终点\n[03:08.909]我想把时间揉成碎片捧在我手心\n[03:18.710]约会见\n[03:24.310]再见面就是永远\n",
          },
          // {
          //   id: 549320309,
          //   author: "棱镜乐队",
          //   title: "克林",
          //   url: "http://m7.music.126.net/20230526200643/11da93e762d886c5d3fa7ae7e21c52a5/ymusic/64ce/a7aa/dab6/29eaf87d0ee45407255114673b8f00f3.mp3",
          //   pic: "https://p1.music.126.net/6VTLVzDcp8ZtKVPBLOF5eg==/109951163203484145.jpg",
          //   lrc: "[00:00.00] 作词 : 陈恒冠\n[00:01.00] 作曲 : 陈恒冠\n[00:02.03]监制：1991与她\n[00:03.25]直到今天我都不知道\n[00:09.13]你究竟以什么谋生\n[00:15.02]不过这也不是太重要\n[00:20.21]从不关心阳光草也长得很好\n[00:26.87]喝茶和赏雨已经不再让我安详\n[00:32.35]偶然又一起跨上摩托冲到边境\n[00:38.38]排气狂暴轰鸣中跨过半省\n[00:44.32]大山湿雾弥漫里吐出烟气\n[00:50.40]克林 上路是偶然\n[00:56.09]如鲸向海 请取笑那些苦难吧\n[01:02.32]克林 人生是偶然\n[01:07.95]依旧浪漫 尽管你知道后来啊\n[01:14.29]克林 上路是偶然\n[01:20.01]离开那些 曾吞没你的欲望吧\n[01:26.18]克林 人生是偶然\n[01:31.81]在自己的路上 义无反顾的狂奔吧\n[02:08.25]喝茶和赏雨已经不再让我安详\n[02:14.08]偶然又一起跨上摩托冲到边境\n[02:19.97]排气狂暴轰鸣中跨过半省\n[02:25.91]大山湿雾弥漫里吐出烟气\n[02:31.96]克林 上路是偶然\n[02:37.55]如鲸向海 请取笑那些苦难吧\n[02:43.92]克林 人生是偶然\n[02:49.47]依旧浪漫 尽管你知道后来啊\n[02:55.80]克林 上路是偶然\n[03:02.28]离开那些 曾吞没你的欲望吧\n[03:08.59]克林 人生是偶然\n[03:14.02]在自己的路上 义无反顾的狂奔吧\n[03:44.45]克林 上路是偶然\n[03:50.01]如鲸向海 请取笑那些苦难吧\n[03:56.34]克林 人生是偶然\n[04:01.96]依旧浪漫 尽管你知道后来啊\n[04:08.29]克林 上路是偶然\n[04:13.93]离开那些 曾吞没你的欲望吧\n[04:20.22]克林 人生是偶然\n[04:25.79]在自己的路上 义无反顾的狂奔吧！\n[04:39.91]（克林）\n[04:42.90]（克林……慢点儿！）\n[04:47.92]编曲：陈恒冠/陈恒家\n[04:50.90]吉他：陈恒家/龚培超\n[04:52.90]录音：陈恒家@1019Studio\n[04:54.90]混音：陈恒家\n[04:58.90]摩托：克林＆（春风650MT）\n",
          // },
          {
            id: 1473721141,
            author: "棱镜乐队",
            title: "无法拥有的人要好好道别",
            url: "https://shuaigang.top/gsg/music/wfyydryhhdb.mp3",
            pic: "https://p1.music.126.net/5QqPaUiTnTVxB5dZxDX3_Q==/109951165266634946.jpg",
            lrc: "[00:00.000] 作词 : 刘喜龙\n[00:01.000] 作曲 : 白晨阳/陈恒冠\n[00:14.173]编曲：陈恒冠\n[00:22.608]不必再说了\n[00:25.110]我能给的都已经给过了\n[00:30.861]没什么性格不合\n[00:35.862]别拉扯\n[00:38.108]至少我们一起快乐过\n[00:43.860]我们度过的\n[00:46.360]是任何人都无法替代的\n[00:52.113]我们曾经那么近\n[00:57.111]我的心\n[00:59.358]永远有个位置是你的\n[01:07.861]再释怀一些\n[01:10.363]无法拥有的人要好好道别\n[01:16.113]好好看她最后一眼\n[01:21.114]别说抱歉\n[01:23.612]一辈子总要有一次坚决一点\n[01:29.114]再痛快一些\n[01:31.868]无法拥有的人要好好道别\n[01:37.356]最美的都留给昨天\n[01:42.364]彼此心安\n[01:44.864]留给下半生一个完美的想念\n[02:17.107]我们度过的\n[02:19.857]是任何人都无法替代的\n[02:25.613]我们曾经那么近\n[02:30.609]我的心\n[02:32.858]永远有个位置是你的\n[02:38.358]再释怀一些\n[02:41.109]无法拥有的人要好好道别\n[02:46.862]好好看她最后一眼\n[02:51.859]别说抱歉\n[02:54.108]一辈子总要有一次坚决一点\n[02:59.861]再痛快一些\n[03:02.611]无法拥有的人要好好道别\n[03:08.116]最美的都留给昨天\n[03:13.116]彼此心安\n[03:15.360]留给下半生一个完美的想念\n[03:26.364]你是我人生中最美的一个\n[03:31.362]我也获得了爱你的资格\n[03:36.862]没有遗憾地拥抱过\n[03:42.112]所以分开也需要更洒脱\n[03:47.808]更洒脱\n[03:50.559]再释怀一些\n[03:53.060]无法拥有的人要好好道别\n[03:58.809]好好看她最后一眼\n[04:03.810]别说抱歉\n[04:06.060]一辈子总要有一次坚决一点\n[04:11.808]再痛快一些\n[04:14.563]无法拥有的人要好好道别\n[04:20.312]最美的都留给昨天\n[04:25.061]彼此心安\n[04:27.560]留给下半生一个完美的想念\n[04:39.064]录音：陈恒家\n[04:43.060]钢琴：陈恒冠\n[04:48.061]和声：陈恒冠\n[04:52.067]弦乐编写：陈恒冠\n[04:55.557]和声编写：陈恒家 陈恒冠\n[04:58.308]混音：陈恒家@37PRO\n[05:02.315]母带：陈恒家@37PRO\n",
          },
          // {
          //   id: 1418131335,
          //   author: "棱镜乐队",
          //   title: "岛屿",
          //   url: "http://m7.music.126.net/20230526211626/a6905a8fc48c5d8b50c087274a0b5d3a/ymusic/060e/0552/515b/1dba6f94c2281e06ea53f12bf9492905.mp3",
          //   pic: "https://p1.music.126.net/5QqPaUiTnTVxB5dZxDX3_Q==/109951165266634946.jpg",
          //   lrc: "[00:00.000] 作词 : 苏喜多/挡风玻璃\n[00:01.000] 作曲 : 苏喜多/陈恒冠\n[00:02.000] 编曲 : 陈恒冠/陈恒家\n[00:31.154]你戴上帽子遮住眼睛 轻轻地绕着我 总洋溢着暖\n[00:44.404]我…我只能唱\n[00:54.902]你像气泡水直接淘气 爱和星星眨眼睛 轻易抓住我\n[01:07.903]我…我只能唱\n[01:16.651]有一个岛屿 在北极冰川\n[01:23.403]那儿没有花朵 也没有失落\n[01:30.159]在那个岛屿 洒满了繁星\n[01:36.904]拥有我和你 再没有失落\n[02:15.903]你邀请流浪期待欢喜 惹我专心好奇 我看见了光\n[02:29.153]我…我只能唱\n[02:39.403]难免坏天气闪电暴雨 练就肩膀和勇气 只为你拥抱我\n[02:54.156]我…我只能唱\n[03:01.659]有一个岛屿 在北极冰川\n[03:08.154]那儿没有花朵 也没有失落\n[03:14.906]在那个岛屿 洒满了繁星\n[03:21.651]拥有我和你 再没有失落\n[03:28.656]有一个岛屿 在北极冰川\n[03:35.152]那儿没有花朵 也没有失落\n[03:41.904]在那个岛屿 洒满了繁星\n[03:48.661]拥有我和你 再没有失落\n[03:59.159]有一个岛屿 在北极冰川\n[04:05.654]那儿没有花朵 也没有失落\n[04:12.659]在那个岛屿 洒满了繁星\n[04:19.152]拥有我和你 再没有失落\n[04:26.405]有一个岛屿 在北极冰川\n[04:33.658]那儿没有花朵 也没有失落…\n[04:40.401]吉他：陈恒家\n[04:42.654]钢琴：陈恒冠\n[04:47.407]混音：陈恒家\n[04:49.907]母带：陈恒家\n[04:53.907]监制：1991与她\n",
          // },
          // {
          //   id: 1868874994,
          //   author: "棱镜乐队",
          //   title: "心动",
          //   url: "http://m801.music.126.net/20230526200802/a62bf0498316dea1edbcb2a885464e86/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/10295849120/905a/d5bf/20ca/ab6a6615fe18156657f36843cfd57182.mp3",
          //   pic: "https://p1.music.126.net/6qHEz6cFxbxhSIQwsEimrw==/109951166279509814.jpg",
          //   lrc: "[00:00.00] 作词 :  林夕\n[00:01.00] 作曲 : 黄韵玲\n[00:10.23]出品：网易云音乐×云上工作室×青云 LAB\n[00:16.44]有多久没见你\n[00:21.87]以为你在哪里\n[00:27.57]原来就住在我心底\n[00:33.24]陪伴着我呼吸\n[00:38.94]有多远的距离\n[00:42.66]以为闻不到你的气息\n[00:50.25]谁知道你背影这么长\n[00:56.10]回头就看到你\n[01:01.83]过去让它过去\n[01:05.73]来不及\n[01:07.92]从头喜欢你\n[01:11.49]白云缠绕着蓝天\n[01:16.86]如果不能够永远走在一起\n[01:22.56]也至少给我们\n[01:25.59]怀念的勇气\n[01:28.89]拥抱的权利\n[01:31.80]好让你明白\n[01:33.96]我心动的痕迹\n[02:04.56]有多远的距离\n[02:08.56]以为闻不到你的气息\n[02:16.96]谁知道你背影这么长\n[02:21.96]回头就看到你\n[02:22.50]过去让它过去\n[02:31.50]来不及\n[02:33.63]从头喜欢你\n[02:37.23]白云缠绕着蓝天\n[02:42.57]如果不能够永远走在一起\n[02:48.30]也至少给我们\n[02:51.48]怀念的勇气\n[02:54.30]拥抱的权利\n[02:57.60]好让你明白\n[02:59.73]我心动的痕迹\n[03:30.42]总是想再见你\n[03:36.15]还试着打探你的消息\n[03:41.88]原来你就住在我的身体\n[03:47.64]守护我的回忆\n[03:48.52] 钢琴 : 陈恒冠\n[03:49.40] 吉他 : 陈恒家\n[03:50.28] 录音 : 陈恒家\n[03:51.16] 混音 : 陈恒家\n[03:52.04] 母带 : 陈恒家\n[03:52.92] 封面设计 : 赵明\n[03:53.80] 总策划 : 丁博/黄俊/赵睿/唐晶晶\n[03:54.68] 企划 : 回凤超/陈尚禔/王梦菲\n[03:55.56] 策划 : 洪乙/姜家瑶\n[03:56.45] OP：Denseline Co Limited (Warner Chappell Music, Hong Kong Limited)\n[03:57.33] OP：Go Ahead Public Ltd. Company\n[03:58.21] SP：Warner Chappell Music Publishing Agency (Beijing) Ltd.\n[03:59.09] SP：Universal Music Publishing CHINA \n",
          // },
          // {
          //   id: 2042984221,
          //   author: "棱镜乐队",
          //   title: "不说可惜",
          //   url: "http://m801.music.126.net/20230526200820/c014a4686813a16150195e849da3c36d/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/27212403000/d642/466b/d149/8fb9f9448245f5bd12e8b30f090b6c1d.mp3",
          //   pic: "https://p2.music.126.net/6dHYE_ebzgSybXYw6i77GA==/109951168574284483.jpg",
          //   lrc: "[00:14.880]每个角落人群都拥挤\n[00:22.080]空隙隔离彼此的悲喜\n[00:29.790]相遇如果可计算机率\n[00:36.180]结果会不会是零点零零几\n[00:43.920]每个场景都会出现你\n[00:51.180]自欺欺人也是种慰己\n[00:58.830]相爱倘若算一种挑衅\n[01:05.190]需要多少英勇才不会奔离\n[01:12.630]和你相遇已经是不可思议\n[01:20.040]我怎么能忍心强留你珍惜\n[01:26.670]到了怎样的年纪\n[01:28.860]才能平静地说出可惜\n[01:33.360]哪怕最后等不到你\n[01:38.310]我也甘心放弃\n[01:41.070]若把曾经当永期\n[01:43.440]是否可以不再说可惜\n[01:47.940]虽然一切早已过去\n[01:52.800]至少我\n[01:53.670]我可以安心回忆\n[02:14.940]每个场景都会出现你\n[02:22.110]自欺欺人也是种慰己\n[02:29.790]相爱倘若算一种挑衅\n[02:36.090]需要多少英勇才不会奔离\n[02:43.590]和你相遇已经是不可思议\n[02:51.060]我怎么能忍心强留你珍惜\n[02:57.630]到了怎样的年纪\n[02:59.790]才能平静地说出可惜\n[03:04.380]哪怕最后等不到你\n[03:09.180]我也甘心放弃\n[03:12.150]若把曾经当永期\n[03:14.370]是否可以不再说可惜\n[03:18.840]虽然一切早已过去\n[03:23.730]至少我可以安心回忆\n[03:52.200]到了怎样的年纪\n[03:54.300]才能平静地说出可惜\n[03:58.860]哪怕最后等不到你\n[04:03.870]我也甘心放弃\n[04:06.690]若把曾经当永期\n[04:09.000]是否可以不再说可惜\n[04:13.440]虽然一切早已过去\n[04:18.300]至少我可以安心回忆\n[04:20.300]钢琴 / 弦乐编写：陈恒冠\n[04:22.300]吉他：陈恒家\n[04:24.300]贝斯：朱洪远\n[04:26.300]鼓：武勇恒（贝贝）\n[04:28.300]弦乐：国际首席爱乐团\n[04:30.300]录音：陈恒家\n[04:32.300]混音：陈恒家\n[04:34.300]母带：曾威棣@Tone Zone Lab\n[04:36.300]封面摄影：兀鱼横流\n[04:38.300]手写字体：陈一日\n[04:40.300]平面设计：1991与她\n[04:42.300]特别支持：王泽楠\n[04:43.900]特别鸣谢：皮皮\n[04:46.300]监制：1991与她\n",
          // },
          {
            id: 1473720185,
            author: "棱镜乐队",
            title: "成为彼此宇宙的终极浪漫",
            url: "https://shuaigang.top/gsg/music/cwbcyzdzjlm.mp3",
            pic: "",
            lrc: "[00:00.000] 作词 : 高原\n[00:01.000] 作曲 : 陈恒冠\n[00:12.177]编曲：陈恒冠\n[00:21.864]想不出更好的原因\n[00:25.359]晴空许愿星\n[00:27.364]按耐不住想念你\n[00:31.866]爱迪生也解释不清\n[00:35.358]量子纠缠域\n[00:37.368]不可思议的亲昵\n[00:42.112]这感觉未免太神秘\n[00:45.116]命运的恶作剧\n[00:47.114]兜兜转转雨转晴\n[00:51.859]没人能了解的心情\n[00:55.364]无聊的小游戏\n[00:57.359]忘记不了你眼睛\n[01:00.612]有奇迹\n[01:01.860]想和你坐直升飞机\n[01:06.856]想和你环热带岛屿\n[01:11.856]想和你看星空极地\n[01:16.855]想和你睡在宇宙里\n[01:21.864]你说你不知道该去哪里\n[01:24.112]我说我也可以和你一起\n[01:26.864]一起看海洋淹没了陆地\n[01:30.108]再淹没森林\n[01:31.864]你说你不知道该去哪里\n[01:34.116]我说我也可以和你一起\n[01:36.861]一起等太阳落下了天际\n[01:40.114]就变成星星\n[01:51.859]这感觉未免太神秘\n[01:55.111]命运的恶作剧\n[01:57.359]兜兜转转雨转晴\n[02:01.859]没人能了解的心情\n[02:05.362]无聊的小游戏\n[02:07.359]忘记不了你眼睛\n[02:11.617]想和你坐直升飞机\n[02:16.614]想和你环热带岛屿\n[02:21.865]想和你看星空极地\n[02:26.868]想和你睡在宇宙里\n[02:31.611]我独自站在洪流汪洋深渊漩涡中央\n[02:36.613]你就是我不灭的勇往\n[02:41.613]无惧世界末日宇宙灭亡\n[02:44.615]只要你 陪伴在我身旁 笑容里面有太阳\n[02:51.859]想和你坐直升飞机（飞跃凌空万米）\n[02:56.861]想和你环热带岛屿（沙滩留脚印）\n[03:01.860]想和你看星空极地（蓝色地球有奥秘）\n[03:06.857]想和你睡在宇宙里（不分离）\n[03:11.617]我独自站在洪流汪洋深渊漩涡中央\n[03:16.614]你就是我不灭的勇往\n[03:20.860]只想要和你永远永远在一起\n[03:26.614]想和你坐直升飞机（飞跃凌空万米）\n[03:32.053]想和你环热带岛屿（沙滩留脚印）\n[03:37.053]想和你看星空极地（蓝色地球有奥秘）\n[03:41.810]想和你睡在宇宙里（不分离）\n[03:46.558]你说你不知道该去哪里\n[03:49.059]我说我也可以和你一起\n[03:51.556]一起看海洋淹没了陆地\n[03:55.556]再淹没森林\n[03:57.057]你说你不知道该去哪里\n[03:59.305]我说我也可以和你一起\n[04:02.057]一起等太阳落下了天际\n[04:05.057]就变成星星\n[04:07.558]录音：陈恒家\n[04:09.054]吉他：陈恒家\n[04:11.556]和声：陈恒冠 陈恒家\n[04:13.311]混音：陈恒冠 陈恒家@37PRO\n[04:14.808]母带：陈恒家@37PRO\n",
          },
          {
            id: 1473721137,
            author: "棱镜乐队",
            title: "爱你就像习惯了叹息一样",
            url: "https://shuaigang.top/gsg/music/anjxxgltxyy.mp3",
            pic: "https://p2.music.126.net/5QqPaUiTnTVxB5dZxDX3_Q==/109951165266634946.jpg",
            lrc: "[00:00.000] 作词 : 高原\n[00:01.000] 作曲 : 陈恒冠\n[00:14.176]编曲：陈恒冠\n[00:21.424]人声：陈恒家 陈恒冠\n[00:28.418]楼顶天窗 书信终章 写在镜子上\n[00:35.426]你的名字涂满星光\n[00:42.171]手中信鸽 会说谎  我只想\n[00:47.673]祝福它自由去飞翔\n[00:55.674]对很多人 怀有很深 很深的感想\n[01:01.175]尤其是 对你有些不一样\n[01:07.422]就好像 一样时光 一样地方 不一样\n[01:14.676]是等不到你的我身旁\n[01:20.921]爱你就像 失望拥抱希望\n[01:28.170]我妄想 奔向河流的海洋\n[01:34.423]爱你就像 失望怀抱希望\n[01:41.672]你站在 我到不了的地方\n[02:16.673]对很多人 怀有很深 很深的感想\n[02:22.429]尤其是 对你有些不一样\n[02:28.671]就好像 一样时光 一样地方 不一样\n[02:35.679]是等不到你的我身旁\n[02:42.173]爱你就像 失望拥抱希望\n[02:49.421]我妄想 奔向河流的海洋\n[02:55.676]爱你就像 失望怀抱希望\n[03:02.922]你站在 我到不了的地方\n[03:09.175]爱你就像 热爱生命一样\n[03:16.423]那么你 是否也同我一样\n[03:22.678]爱你就像 习惯叹息一样\n[03:29.926]就像你 不想要这个宇宙一样\n[03:36.670]爱你就像 热爱 生命一样\n[03:43.427]那么你 是否也能同我一样\n[03:49.671]爱你就像 习惯 叹息一样\n[03:56.918]就像你 不想要这宇宙一样\n[04:05.171]录音：陈恒家\n[04:07.920]弦乐编写：陈恒冠\n[04:10.420]钢琴：陈恒冠\n[04:16.673]和声：陈恒冠 陈恒家\n[04:21.423]混音：陈恒家@37PRO\n[04:24.926]母带：陈恒家@37PRO\n",
          },
          {
            id: 25731320,
            author: "海龟先生",
            title: "男孩别哭",
            url: "https://shuaigang.top/gsg/music/nhbk.mp3",
            pic: "https://p1.music.126.net/g3iuiLZVhrr_RQjcbBm1ww==/109951166580938676.jpg",
            lrc: "[00:00.000] 作词 : 海龟先生\n[00:01.000] 作曲 : 海龟先生\n[00:02.900]我跟你描述一个灵魂\n[00:05.940]它拥有不谢的青春\n[00:08.910]每当夜色降临\n[00:11.130]就会轻轻歌唱\n[00:13.540]它唱着一个新鲜的故事\n[00:16.360]里面的人们相互微笑\n[00:19.130]是不是每个夜晚都要这样\n[00:21.500]为了爱\n[00:23.070]去用清醒交换\n[00:25.030]男孩别哭\n[00:27.060]美丽世界的孤儿\n[00:29.800]可我的心\n[00:31.280]我的家\n[00:32.930]在哪里\n[00:34.380]在哪里呢我的朋友\n[00:36.470]静静地听\n[00:38.650]有个声音在说爱你\n[00:41.570]闭上眼\n[00:43.110]跟随她\n[00:44.530]跟随她 就像跟着希望\n[00:47.920]那些城市上空飘着一颗颗不安的心\n[00:50.930]她一定也曾在这儿跳过欢快的舞蹈\n[00:54.050]清风吹来让我感到一阵迷醉\n[00:56.400]那婆娑的身影\n[00:57.720]太阳般光洁\n[00:59.340]那些男孩一次次地叫着寂寞妈妈\n[01:02.060]爱是否能抚平他们内心的内心的伤痕\n[01:06.330]孤独的人呐\n[01:08.810]我带上你走\n[01:10.600]boy boy boy isolation\n[01:13.460]bye bye bye bye bye a one night stand\n[01:16.900]Dance dance in nowhere\n[01:18.940]Don't don't don't don't don't be afraid again\n[01:21.860]boy boy boy isolation\n[01:24.570]bye bye bye bye bye a one night stand\n[01:27.330]Dance dance in nowhere\n[01:30.150]Don't don't don't don't you don't don't don't be afraid\n[01:33.030]\n[01:55.810]我跟你描述一个灵魂\n[01:58.540]它拥有不谢的青春\n[02:01.450]每当夜色降临\n[02:04.260]就会轻轻歌唱\n[02:06.970]它唱着一个新鲜的故事\n[02:10.020]里面的人们相互微笑\n[02:12.950]是不是每个夜晚都要这样\n[02:15.230]为了爱\n[02:16.540]去用清醒交换\n[02:18.400]男孩别哭\n[02:20.580]美丽世界的孤儿\n[02:23.190]可我的心\n[02:24.560]我的家\n[02:26.060]在哪里\n[02:27.500]在哪里呢我的朋友\n[02:29.600]静静地听\n[02:31.720]有个声音在说爱你\n[02:34.580]闭上眼\n[02:35.920]跟随她\n[02:37.330]跟随她 就像跟着希望\n[02:40.980]那些城市上空飘着一颗颗不安的心\n[02:44.020]她一定也曾在这儿跳过欢快的舞蹈\n[02:46.730]清风吹来让我感到一阵迷醉\n[02:49.240]那婆娑的身影\n[02:50.480]太阳般光洁\n[02:52.360]那些男孩一次次地叫着寂寞妈妈\n[02:54.900]爱是否能抚平他们内心的内心的伤痕\n[02:59.320]孤独的人啊\n[03:01.990]我带上你走\n[03:03.550]boy boy boy isolation\n[03:06.310]bye bye bye bye bye a one night stand\n[03:09.140]Dance dance in no way\n[03:11.680]Don't don't don't don't don't be afraid again\n[03:14.630]boy boy boy isolation\n[03:17.750]bye bye bye bye bye a one night stand\n[03:20.180]Dance dance  in no way\n[03:23.150]Don't don't don't don't you don't don't don't be afraid\n[03:48.890]这是一个放肆狂妄的年代\n[03:51.350]我们的身体\n[03:52.880]怎能时刻拥抱在一起\n[03:55.300]去见证这样的爱情\n[03:58.210]早已筋疲力尽\n[04:00.210]你脸上尽管挂着深深的泪痕\n[04:02.640]我的心 我的爱\n[04:04.220]还是跟着梦想远走\n[04:06.520]去寻找另一个生命\n[04:09.550]它会带上我走\n[04:11.320]boy boy boy isolation\n[04:14.100]bye bye bye bye bye a one night stand\n[04:17.350]Dance dance  in nowhere\n[04:19.770]Don't don't don't don't don't be afraid again\n[04:22.440]boy boy boy isolation\n[04:25.450]bye bye bye bye bye a one night stand\n[04:29.530]Dance dance  in nowhere\n[04:31.040]Don't don't don't don't you don't don't don't be afraid\n[04:35.020]\n",
          },
          {
            id: 306709,
            author: "许美静",
            title: "倾城",
            url: "https://shuaigang.top/gsg/music/qc.mp3",
            pic: "https://p2.music.126.net/2SeDM9ixmhLtP-RJS0jVsA==/109951164973473461.jpg",
            lrc: "[00:00.000] 作词 : 黄伟文\n[00:01.000] 作曲 : 陈佳明\n[00:02.000] 编曲 : 吴庆隆\n[00:23.039]热情就算熄灭了\n[00:29.909]分手这一晚也重要\n[00:35.700]甜言蜜语谎话嬉笑\n[00:38.890]多给我一点 不要缺少\n[00:43.290]话题尽了也不紧要\n[00:46.109]吻我至凄冷的深宵\n[00:49.909]繁华闹市灯光普照\n[00:53.629]然而共你已再没破晓\n[00:58.439]红眼睛幽幽地看着这孤城\n[01:01.539]如同苦笑挤出的高兴\n[01:05.349]全城为我花光狠劲\n[01:10.099]浮华盛世作分手布景\n[01:13.379]传说中痴心的眼泪会倾城\n[01:17.190]霓虹熄了世界渐冷清\n[01:20.619]烟花会谢 笙歌会停\n[01:24.679]显得这故事尾声更动听\n[02:03.439]热情就算熄灭了\n[02:07.958]分手这一晚也重要\n[02:12.090]甜言蜜语谎话嬉笑\n[02:15.639]多给我一点 不要缺少\n[02:19.559]话题尽了也不紧要\n[02:23.189]吻我至凄冷的深宵\n[02:27.049]繁华闹市灯光普照\n[02:31.109]然而共你已再没破晓\n[02:36.690]红眼睛幽幽的看着这孤城\n[02:38.629]如同苦笑挤出的高兴\n[02:42.329]全城为我花光狠劲\n[02:46.028]浮华盛世做分手布景\n[02:50.319]传说中痴心的眼泪会倾城\n[02:54.499]霓虹熄了世界渐冷清\n[02:57.649]烟花会谢 笙歌会停\n[03:01.629]显得这故事尾声更动听\n[03:12.639]红眼睛幽幽的看着这孤城\n[03:16.919]如同苦笑挤出的高兴\n[03:20.319]琼楼玉宇倒了阵形\n[03:24.539]来营造这绝世的风景\n[03:28.039]传说中痴心的眼泪会倾城\n[03:31.949]霓虹熄了世界渐冷清\n[03:35.990]烟花会谢 笙歌会停\n[03:39.679]显得这故事尾声更动听\n",
          },
          {
            id: 85571,
            author: "郭顶",
            title: "我们俩",
            url: "https://shuaigang.top/gsg/music/wml.mp3",
            pic: "https://p2.music.126.net/WpUDvtRGZc-WE3nuw-PgsA==/85761906967212.jpg",
            lrc: "[00:00.000] 作词 : 张莹\n[00:00.180] 作曲 : 郭顶\n[00:00.360] 编曲 : 王智翔\n[00:00.540] 制作人 : 王智翔\n[00:00.720]你在左边 我紧靠右\n[00:04.440]第一张照片\n[00:06.320]不太敢亲密的\n[00:07.820]\n[00:08.580]属于我们俩的\n[00:09.980]\n[00:10.500]脸庞太天真了\n[00:11.840]\n[00:12.550]苹果一样带甜的羞涩\n[00:16.440]太多感触\n[00:17.980]\n[00:18.520]已不同了\n[00:19.830]\n[00:20.510]世界变了\n[00:22.300]还是我改变了\n[00:23.910]夹在书本这相册\n[00:27.250]滑落的照片让我变沉默\n[00:31.950]太久 太久 是否过了太久\n[00:36.170]忘了 忘了 开始怎开始的\n[00:39.930]\n[00:40.510]喝醉了小河边唱着歌\n[00:44.470]永远爱你是我说过\n[00:48.160]没有 没有 再没谁能拥有\n[00:52.100]像你 像我 哭和笑都懂得\n[00:57.120]再触摸\n[00:59.290]我心底藏了好久\n[01:01.520]那最柔软的角落\n[01:06.347]\n[01:22.970]你在左边 我紧靠右\n[01:26.610]第一张照片\n[01:28.590]不太敢亲密的\n[01:30.188]\n[01:30.798]属于我们俩的\n[01:32.700]脸庞太天真了\n[01:34.149]\n[01:34.810]苹果一样带甜的羞涩\n[01:38.750]太多感触\n[01:40.300]\n[01:40.819]已不同了\n[01:42.569]世界变了\n[01:44.560]还是我改变了\n[01:46.340]夹在书本这相册\n[01:49.399]滑落的照片让我变沉默\n[01:54.378]太久 太久 是否过了太久\n[01:58.429]忘了 忘了 开始怎开始的\n[02:02.810]喝醉了小河边唱着歌\n[02:06.798]永远爱你是我说过\n[02:09.837]\n[02:10.397]没有 没有 再没谁能拥有\n[02:14.268]像你 像我 哭和笑都懂得\n[02:19.458]再触摸\n[02:21.617]我心底藏了好久\n[02:23.729]那最柔软的角落\n[02:26.497]太久 太久 是否过了太久\n[02:30.337]忘了 忘了 开始怎么开始的\n[02:34.687]\n[02:35.699]喝醉了小河边唱着歌\n[02:38.818]永远爱你是我说过\n[02:42.288]没有 没有 再没谁能拥有\n[02:46.410]像你 像我 哭和笑都懂得\n[02:51.479]再触摸\n[02:53.639]我心底藏了好久\n[02:55.247]\n[02:55.800]那最柔软的角落\n",
          },
          {
            id: 441491828,
            author: "郭顶",
            title: "水星记",
            url: "https://shuaigang.top/gsg/music/sxj.mp3",
            pic: "https://p1.music.126.net/wSMfGvFzOAYRU_yVIfquAA==/2946691248081599.jpg",
            lrc: "[00:00.000] 作词 : 郭顶\n[00:01.000] 作曲 : 郭顶\n[00:02.000] 编曲 : 郭顶\n[00:03.000] 监制 : 郭顶\n[00:19.200]着迷于你眼睛\n[00:21.510]\n[00:22.910]银河有迹可循\n[00:25.040]\n[00:26.160]穿过时间的缝隙\n[00:28.980]\n[00:29.740]它依然真实地\n[00:32.750]\n[00:33.460]吸引我轨迹\n[00:36.230]\n[00:40.440]这瞬眼的光景\n[00:42.950]\n[00:43.970]最亲密的距离\n[00:46.550]\n[00:47.470]沿着你皮肤纹理\n[00:51.380]走过曲折手臂\n[00:54.040]\n[00:54.960]做个梦给你\n[00:57.230]\n[00:58.580]做个梦给你\n[01:01.249]\n[01:03.668]等到看你银色满际\n[01:06.260]\n[01:07.069]等到分不清季节更替\n[01:11.590]\n[01:12.938]才敢说沉溺\n[01:16.078]\n[01:19.980]还要多远才能进入你的心\n[01:26.200]\n[01:27.170]还要多久才能和你接近\n[01:33.310]\n[01:34.328]咫尺远近却\n[01:36.780]无法靠近的那个人\n[01:42.000]也等着和你相遇\n[01:47.610]\n[01:49.030]环游的行星\n[01:51.750]\n[01:52.269]怎么可以\n[01:55.170]\n[01:56.129]拥有你\n[01:57.989]\n[02:13.728]这瞬眼的光景\n[02:16.269]\n[02:17.119]最亲密的距离\n[02:19.679]\n[02:20.628]沿着你皮肤纹理\n[02:24.310]走过曲折手臂\n[02:27.359]\n[02:28.060]做个梦给你\n[02:30.478]\n[02:31.579]做个梦给你\n[02:34.619]\n[02:36.589]等到看你银色满际\n[02:40.288]等到分不清季节更替\n[02:44.660]\n[02:45.869]才敢说沉溺\n[02:53.138]还要多远才能进入你的心\n[02:59.399]\n[03:00.329]还要多久才能和你接近\n[03:06.478]\n[03:07.429]咫尺远近却\n[03:09.560]无法靠近的那个人\n[03:15.128]也等着和你相遇\n[03:20.638]\n[03:21.829]环游的行星\n[03:24.739]\n[03:25.388]怎么可以\n[03:29.079]拥有你\n[03:35.530]\n[04:05.218]还要多远才能进入你的心\n[04:10.869]\n[04:11.929]还要多久才能和你接近\n[04:18.028]\n[04:19.050]咫尺远近却无法靠近的那个人\n[04:26.687]要怎么探寻\n[04:30.319]要多么幸运\n[04:33.538]才敢让你发觉你并不孤寂\n[04:39.778]\n[04:40.509]当我还可以再跟你飞行\n[04:46.579]\n[04:47.690]环游是无趣\n[04:50.569]\n[04:51.339]至少可以\n[04:54.639]\n[04:55.240]陪着你\n",
          },
          {
            id: 536483221,
            author: "邹念慈",
            title: "你怎么蠢到我喜欢你都不知道",
            url: "https://shuaigang.top/gsg/music/nzmcdwxhndbzd.mp3",
            pic: "https://p1.music.126.net/lEybD09WAflaIkPj91qv2w==/109951166608686943.jpg",
            lrc: "[00:00.000] 作词 : 邹念慈\n[00:01.000] 作曲 : 邹念慈\n[00:07.149]监制：余倩楠\n[00:10.151]原编曲：太子\n[00:12.110]改编：曾吴秋杰\n[00:13.973]录音：李坚瑜\n[00:16.229]混音：Ear House Studio\n[00:16.729]出品发行：不要音乐\n[00:19.150]我的眼神已经很明了\n[00:24.686]尽管缥缈 还是落在你身上\n[00:33.746]有些时候感觉很微妙\n[00:38.603]傻乎乎地 等你回应微笑\n[00:47.201]怎么 你看不到 我的 这些讯号\n[01:01.479]怎么 你听不到 任我 沉默咆哮\n[01:20.662]圈圈点点的缱绻\n[01:24.135]所有防备瓦解在你面前\n[01:27.784]怎么你却视而不见\n[01:35.438]慌乱情绪扰动心跳\n[01:38.775]不由自主看向你方向\n[01:42.543]你怎么可以 蠢到我喜欢你 都不知道\n[02:04.593]是我 想要看清 捕捉细小表情\n[02:18.842]是我 想要听明 寻找认同的声音\n[02:34.613]圈圈点点的缱绻\n[02:38.203]所有防备瓦解在你面前\n[02:41.542]怎么你却视而不见\n[02:49.288]慌乱情绪扰动心跳\n[02:52.928]不由自主看向你方向\n[02:56.774]你怎么可以 蠢到我喜欢你 都不知道\n[03:11.385]兜兜转转的试探\n[03:15.265]千言万语只敢说晚安\n[03:18.712]偶尔勇敢 在你面前却很短暂\n[03:25.953]我愿意为你只为你\n[03:29.818]哪怕最后只剩我自己\n[03:33.272]只要你别再蠢到我喜欢你 都不知道\n[03:58.123]“喜欢这种东西”\n[04:00.730]“从眼睛就可以看出来”\n",
          },
          {
            id: 448707059,
            author: "陈信喆",
            title: "我又想你了",
            url: "https://shuaigang.top/gsg/music/wyxnl.mp3",
            pic: "https://p1.music.126.net/UuhOIZRvk55cqjVeZB3Omw==/18813743464544638.jpg",
            lrc: "[00:00.00] 作词 : 刘雨知\n[00:00.20] 作曲 : 刘雨知\n[00:00.40]混音：EThan\n[00:00.70]编曲 溪风\n[00:01.00]吉他：尉迟春晓\n[00:01.20]\n[00:01.72]我又想你了 我不敢闭上双眼\n[00:10.34]全世界都是你的笑脸\n[00:17.27]我又想你了 穿梭在我们都熟悉的画面\n[00:25.44]一遍一遍 又是一遍\n[00:29.40]在这没有你的世界\n[00:47.58]时钟滴答滴答的提醒我逝去的年华\n[00:55.16]多想是一个孩子又怕 你怪我 太傻\n[01:02.43]眼泪 并不挣扎 爱你爱到不会讲话\n[01:10.40]多想再勇敢一次 做个真正的傻瓜\n[01:17.51]全世界 都知道 你对我有多重要\n[01:25.70]最后只剩下自己 只剩下回忆\n[01:32.68]我又想你了 我不敢闭上双眼\n[01:40.91]全世界都是你的笑脸\n[01:47.48]我又想你了 穿梭在我们都熟悉的画面\n[01:55.54]一遍一遍 又是一遍\n[01:59.56]在这没有你的世界\n[02:16.82]听一首 我们都喜欢的歌\n[02:25.60]前奏刚响起 早已挂满泪滴\n[02:33.23]尝一口 我们都喜欢的味道\n[02:40.58]还没入口 那滋味已变苦\n[02:48.51]这是最后的画面 这是最后的味觉\n[02:55.27]最后只剩下孤单 只剩下想念\n[03:02.54]我又想你了 我不敢闭上双眼\n[03:10.32]全世界都是你的笑脸\n[03:17.80]我又想你了 穿梭在我们都熟悉的画面\n[03:26.00]一遍一遍 又是一遍\n[03:29.71]在这没有你的世界\n[03:40.02]这世界\n[03:47.94]我又想你了 我不敢闭上双眼\n[03:55.65]全世界都是你的笑脸\n[04:02.41]我又想你了 穿梭在我们都熟悉的画面\n[04:10.52]一遍一遍 又是一遍\n[04:14.43]在这没有你的世界\n",
          },
          {
            id: 29750751,
            author: "陈达伟",
            title: "爱很简单",
            url: "https://shuaigang.top/gsg/music/ahjd.mp3",
            pic: "https://p2.music.126.net/cpoUinrExafBHL5Nv5iDHQ==/109951166361218466.jpg",
            lrc: "[00:08.81]忘了是怎么开始\n[00:12.69]也许就是对你 有一种感觉\n[00:22.80]突然间发现自己\n[00:26.35]已深深爱上你 真的很简单\n[00:35.96]爱得地暗天黑都已无所谓\n[00:42.68]是是非非无法抉择\n[00:49.69]没有后悔为爱日夜去跟随\n[00:56.46]那个疯狂的人是我 喔......\n[01:03.00]I love you\n[01:08.85]无法不爱你 Baby 说你也爱我\n[01:16.65]I love you\n[01:22.48]永远不愿意 Baby 失去你\n[01:30.91]不可能更快乐\n[01:35.56]只要能在一起 做什么都可以\n[01:44.42]虽然世界变个不停\n[01:49.29]用最真诚的心 让爱变得简单\n[01:59.69]爱得地暗天黑都已无所谓\n[02:06.41]是是非非无法抉择\n[02:13.39]没有后悔为爱日夜去跟随\n[02:20.22]那个疯狂的人是我 喔...\n[02:26.40]I love you\n[02:32.59]我一直在这里 Baby 一直在爱你\n[02:40.27]I love you yes,I do\n[02:46.37]永远都不放弃\n[02:49.64]这爱你的权利\n[02:54.74]如果你还有一些困惑 Oh no\n[03:01.93]请贴着我的心倾听\n[03:07.46]听我说着爱你 Yes I do\n[03:31.84]Come on now\n[03:45.23]One More Time\n[03:46.75]I love you Yes I do\n[03:53.05]一直在这里 Babe\n[03:55.12]Oh yeah 一直在爱你\n[04:00.50]I love you\n[04:06.65]永远都不放弃\n[04:08.48]这爱你的权利\n",
          },
          {
            id: 1413863166,
            author: "夏日入侵企画",
            title: "想去海边",
            url: "https://shuaigang.top/gsg/music/xqhb.mp3",
            pic: "https://p1.music.126.net/sLWN-iePq4ESOMPER0IWgQ==/109951164602081973.jpg",
            lrc: "[00:00.00] 作词 : 灰鸿啊\n[00:00.19] 作曲 : 灰鸿啊\n[00:00.38]出品：网易云音乐石头计划3摇滚季 X 青云Lab\n[00:01.38]等一个自然而然的晴天\n[00:04.90]我想要带你去海边\n[00:08.39]去留住这个瞬间在来不及挽回之前\n[00:15.95]其实不需要深刻的语言\n[00:20.45]趁现在还有一点时间\n[00:23.22]就当是最后一次\n[00:25.38]再一次和我去冒险\n[00:30.63]不经意划过发尾的指尖\n[00:34.91]还有冰镇汽水的甜\n[00:37.90]猜不到你给谁写\n[00:40.14]带着海风的明信片\n[00:45.36]哦可不可以再专心一点\n[00:48.71]请你不要心不在焉\n[00:52.81]黄昏夕阳还有愿望没实现\n[00:59.43]能不能和你竭尽全力奔跑\n[01:03.99]向着海平线\n[01:07.68]余晖消逝之前都不算终点\n[01:14.00]曾经的关于以后所有的幻想已经太遥远\n[01:22.23]被我们丢在身后的时间\n[01:29.58]不经意划过发尾的指尖\n[01:32.92]还有冰镇汽水的甜\n[01:36.66]猜不到你给谁写\n[01:38.95]带着海风的明信片\n[01:44.09]哦可不可以再专心一点\n[01:47.46]请你不要心不在焉\n[01:51.40]可我却舍不得去挽留你躲闪的双眼\n[01:58.11]能不能和你竭尽全力奔跑\n[02:02.90]向着海平线\n[02:06.44]余晖消逝之前都不算终点\n[02:12.81]曾经的关于以后所有的幻想已经太遥远\n[02:20.72]被我们丢在身后的时间\n[02:27.37]怎么再见\n[02:57.19]能不能和你竭尽全力奔跑\n[03:01.47]向着海平线\n[03:05.15]余晖消逝之前都不算终点\n[03:11.60]曾经的关于以后所有的幻想已经太遥远\n[03:19.88]可记忆中的 你想要我 怎么说再见\n[03:26.99]能不能和你竭尽全力奔跑\n[03:31.14]向着海平线\n[03:34.40]余晖消逝之前都不算终点\n[03:40.99]那是我一直想要只带你去的海边\n[03:49.22]让我们互相折磨的时间\n[03:55.48]怎么再见\n[04:12.95]等一个自然而然的晴天\n[04:16.80]我想要带你去海边\n[04:20.08]制作人：韦伟\n[04:20.60]编曲：夏日入侵企画\n[04:21.10]吉他：肯尼\n[04:21.60]贝斯：皮皮\n[04:22.20]鼓：口儿\n[04:22.61]和声：皮皮\n[04:23.51]监制：1991与她\n[04:23.62]人声编辑：祝薇\n[04:24.08]录音棚：野火春风声音工作室\n[04:24.30]录音/混音：李越\n[04:24.58]母带：Abby road studio(London)\n[04:25.14]企划：小粉\n[04:26.34]统筹：黄鲲 / 张迟\n[04:26.64]特别感谢：敦煌\n",
          },
          {
            id: 1396235002,
            author: "张子豪ICEProud",
            title: "废物（FREESTYLE）",
            url: "https://shuaigang.top/gsg/music/fw.mp3",
            pic: "https://p1.music.126.net/nSIVnvR_NIixv0iQMVLNvg==/109951164420159082.jpg",
            lrc: "[00:00.000] 作词 : 张子豪ICEProud/KnowKnow\n[00:01.000] 作曲 : 张子豪ICEProud/KnowKnow\n[00:08.643]KNOWKNOW：\n[00:10.143]我就是懒我就是颓废躺在沙发当个废物\n[00:13.393]我的游戏你玩不来那就赶紧退出\n[00:15.644]话也懒的讲 因为时间能给我答案\n[00:18.393]你在努力赚钱 我在想钱怎么花完\n[00:21.143]有人开演唱会挣钱 我挣钱为开演唱会\n[00:23.893]如果我是我的粉丝我也不想排队\n[00:26.642]有人出国留学\n[00:27.393]没钱花就骗点学费\n[00:29.143]我出国是挣点学费\n[00:30.394]带着我的乐队\n[00:31.893]我们本质上的区别不大\n[00:33.143]都是二十多岁\n[00:34.392]我却忘记我的余额\n[00:35.393]一块ap能有多贵\n[00:37.144]我懒的跟你讲\n[00:37.893]我到底为什么我会变瘦\n[00:39.644]我讲了你也懒得做\n[00:40.894]抱歉我早都看透\n[00:42.394]做你爱做的事\n[00:43.393]做多了你也会变腻\n[00:44.894]你能听懂我在说什么\n[00:46.392]那也很不容易\n[00:47.643]如果我买的车子能自动驾驶该有多好\n[00:50.393]如果找了个女朋友只开心不吵架多好\n[00:53.893]我把自己变成了个富二代\n[00:56.643]我把我的衣服送到美国卖\n[00:59.143]你在我的后视镜里跑不快\n[01:01.642]然后一脚油门 老铁 goodbye\n[01:03.644]HOOK：\n[01:04.393]我特别懒我就是个废物\n[01:06.893]我特别懒我就是个废物\n[01:09.893]我特别懒我就是个废物\n[01:12.143]废物\n[01:14.894]我特别懒我就是个废物\n[01:17.894]我特别懒我就是个废物\n[01:20.644]我特别懒我就是个废物\n[01:22.643]废物\n[01:30.394]ICEProud：\n[01:35.644]欢迎加入废物派对\n[01:36.893]一帮人等到排队\n[01:38.394]懒的做歌只想打局英雄联盟排位\n[01:40.893]你为了钱彻夜不睡\n[01:42.393]我整晚靠酒精入醉\n[01:43.394]世界废物那么多多我们几个也无所谓\n[01:46.143]\n[01:46.643]道理都懂就是懒得动\n[01:48.644]再过几年之后看你还能玩的动\n[01:51.143]我比大多数人提前完成我的梦\n[01:53.893]比如当个有钱的废物不也是你的梦\n[01:55.894]\n[01:56.644]很多人分不清m和k的音节应该\n[01:58.894]去怎么发\n[01:59.894]所以只是当个空想家而不是梦想家\n[02:02.643]废话说了一堆那做个最后总结\n[02:05.271]如果连废物都当不好那才是整歇\n[02:07.521]HOOK：\n[02:08.520]我特别懒我就是个废物\n[02:11.271]我特别懒我就是个废物\n[02:14.021]我特别懒我就是个废物\n[02:16.271]废物\n[02:19.270]我特别懒我就是个废物\n[02:22.020]我特别懒我就是个废物\n[02:24.520]我特别懒我就是个废物\n[02:27.020]废物\n",
          },
          {
            id: 25702070,
            author: "海龟先生",
            title: "玛卡瑞纳",
            url: "https://shuaigang.top/gsg/music/mkrn.mp3",
            pic: "https://p2.music.126.net/eP3MlGux63ndRJJOjk98Rw==/109951166585796989.jpg",
            lrc: "[00:00.000] 作词 : 海龟先生\n[00:01.000] 作曲 : 海龟先生\n[00:27.200]我早就肯定我的身体\n[00:29.869]被罪恶领入死亡里\n[00:33.149]可从来没有想过\n[00:34.689]现在还能这样\n[00:36.509]散发出芬芳气息\n[00:40.339]这根本还是一个浑浊的夜\n[00:43.649]一直还有期待\n[00:46.899]可这样一个\n[00:48.349]骄傲自大的肢体\n[00:49.899]怎么才能找到你\n[00:53.399]其实你一直就在这里\n[00:57.309]从来就没离开过我\n[01:00.119]放下了自己\n[01:02.509]我才可以去认识你\n[01:06.529]现在我知道你在这里\n[01:11.600]等着我再勇敢一点\n[01:13.419]放下了自己\n[01:15.890]我这就去 去拥抱你\n[01:18.990]她叫做玛卡瑞纳\n[01:22.179]我叫她玛卡瑞纳\n[01:25.679]这就是玛卡瑞纳\n[01:29.590]她叫做玛卡瑞纳\n[01:32.699]\n[01:34.988]我早就肯定我的身体\n[01:38.499]被罪恶领入死亡里\n[01:41.519]可从来没有想过\n[01:43.900]现在还能这样\n[01:44.869]散发出芬芳气息\n[01:48.660]这根本还是一个浑浊的夜\n[01:52.990]一直还有期待\n[01:55.890]可这样一个\n[01:56.809]骄傲自大的肢体\n[01:58.399]怎么才能找到你\n[02:01.599]其实你一直就在这里\n[02:05.669]从来就没离开过我\n[02:08.549]放下了自己\n[02:10.899]我才可以去认识你\n[02:14.910]现在我知道你在这里\n[02:19.190]等着我再勇敢一点\n[02:22.100]放下了自己\n[02:24.120]我这就去 去拥抱你\n[02:27.790]她叫做玛卡瑞纳\n[02:33.980]我叫她玛卡瑞纳\n[02:40.480]这就是玛卡瑞纳\n[02:44.350]她叫做玛卡瑞纳\n[02:47.370]我叫她玛卡瑞纳\n[02:51.100]这就是玛卡瑞纳\n[03:08.369]其实你一直就在这里\n[03:12.510]从来就没离开过我\n[03:15.899]放下了自己\n[03:17.700]我才可以去认识你\n[03:21.700]现在我知道你在这里\n[03:25.859]等着我再勇敢一点\n[03:28.690]放下了自己\n[03:30.890]我这就去去拥抱你\n[03:33.899]她叫做玛卡瑞纳\n[03:37.600]我叫她玛卡瑞纳\n[03:40.529]这就是玛卡瑞纳\n[03:43.850]她叫做玛卡瑞纳\n[03:45.390]\n[03:46.820]她叫做玛卡瑞纳\n[03:50.170]她叫做玛卡瑞纳\n[03:54.160]我叫她玛卡瑞纳\n[03:56.820]这就是玛卡瑞纳\n[04:00.530]\n",
          },
          {
            id: 1895661317,
            author: "柳爽",
            title: "漠河舞厅",
            url: "https://shuaigang.top/gsg/music/mhwt.mp3",
            pic: "https://p2.music.126.net/29dzweYfqrRK6unvvpyDlA==/109951166629923582.jpg",
            lrc: "[00:00.000] 编曲 : 无\n[00:03.881]编曲：王子豪\n[00:04.885]吉他：陈逸伦\n[00:05.672]贝斯：陈岑\n[00:06.436]鼓：王子贤\n[00:28.226]我从没有见过极光出现的村落\n[00:34.014]也没有见过有人 在深夜放烟火\n[00:40.837]晚星就像你的眼睛杀人又放火\n[00:47.493]你什么都没有说 野风惊扰我\n[00:54.698]三千里 偶然见过你\n[01:01.218]花园里 有裙翩舞起\n[01:07.850]灯光底 抖落了晨曦\n[01:14.210]在1980的漠河舞厅\n[01:21.803]如果有时间 你会来看一看我吧\n[01:26.992]看大雪如何衰老的 我的眼睛如何融化\n[01:33.671]如果你看见我的话 请转过身去再惊讶\n[01:41.290]我怕我的眼泪我的白发像羞耻的笑话\n[02:17.272]我从没有见过极光出现的村落\n[02:23.984]也没有见过有人 在深夜放烟火\n[02:30.647]晚星就像你的眼睛杀人又放火\n[02:37.056]你什么都不必说 野风惊扰我\n[02:44.395]可是你 惹怒了神明\n[02:50.438]让你去 还那么年轻\n[02:57.683]都怪你 远山冷冰冰\n[03:04.289]在一个人的漠河舞厅\n[03:10.968]如果有时间 你会来看一看我吧\n[03:16.820]看大雪如何衰老的 我的眼睛如何融化\n[03:23.633]如果你看见我的话 请转过身去再惊讶\n[03:31.061]我怕我的眼泪我的白发像羞耻的笑话\n[03:38.535]如果有一天 我的信念忽然倒塌\n[03:43.740]城市的花园没有花 广播里的声音嘶哑\n[03:50.698]如果真有这天的话 你会不会奔向我啊\n[03:58.602]尘封入海吧\n[04:11.020]（谨此歌献给张德全老人及其已逝爱妻）\n",
          },
          {
            id: 41648129,
            author: "李雪莱",
            title: "生日快乐",
            url: "https://shuaigang.top/gsg/music/srkl.mp3",
            pic: "https://p2.music.126.net/CvoyIDli1TB3OSp6d3PChQ==/2539871862437570.jpg",
            lrc: "[00:00.00] 作词 : 李雪莱\n[00:00.15] 作曲 : 李雪莱\n[00:00.30]祝你二十三岁快乐\n[00:02.75]天天心情不错\n[00:04.96]痘痘全部都好了\n[00:09.15]该吃就吃该喝就喝\n[00:12.59]男票一定找到更好的\n[00:17.29]二十三岁快乐\n[00:18.93]天天都有收获\n[00:20.93]工资马上给全额\n[00:25.19]想唱就唱想说就说\n[00:28.97]遇到好人一定比小人多\n[00:35.24]祝你生日快乐\n[00:36.92]祝你天天快乐\n[00:38.85]祝你从早上起床快乐到晚上进被窝\n[00:42.85]祝你生日快乐\n[00:44.80]祝你天天快乐\n[00:46.81]祝你不用求算命先生也能运气不错\n[00:50.88]祝你生日快乐\n[00:52.71]祝你天天快乐\n[00:54.78]祝你从此时此刻快乐到地球毁灭了\n[00:58.78]祝你生日快乐\n[01:00.73]祝你天天快乐\n[01:02.70]祝你永远永远永远都快乐\n",
          },
          {
            id: 1464928350,
            author: "旅行团乐队",
            title: "红色的河",
            url: "https://shuaigang.top/gsg/music/hsdh.mp3",
            pic: "https://p2.music.126.net/cDeq8TYgfNPHu5YaZBu-5w==/109951165161505058.jpg",
            lrc: "[00:00.000] 作词 : 韦伟/孔一蝉\n[00:00.807] 作曲 : 韦伟\n[00:01.614] 编曲 : 旅行团乐队\n[00:02.421] 制作人 : 旅行团乐队\n[00:03.228] 吉他 : 子君\n[00:04.035] 贝斯 : 子君\n[00:04.842] 鼓 : 徐彪\n[00:05.649] 键盘 : 韦伟\n[00:06.456] 和声 : 孔一蝉/韦伟/子君/徐彪/王大治/2B/孙瑞辰/杨森\n[00:07.263] 录音 : 杨森/韦伟/李越\n[00:08.070] 混音 : 颜仲坤  Simon Li(HK)\n[00:08.877] 母带 : 孟韬\n[00:09.684] 人声编辑 : 祝薇\n[00:10.491] 录音棚 : 时音唱片录音棚/野火春风录音棚/Modernsky Studio\n[00:11.298] 混音室 : 喷气机录音棚 Simon Li at nOiz\n[00:12.105] 母带处理棚 : 愚人梦音乐坊\n[00:12.912] 艺术指导 : Annsey赵宏韬\n[00:13.719] 平面设计 : Annsey赵宏韬\n[00:14.526] 字体设计 : 行行珂\n[00:15.333] 插图:老二\n[00:16.142]（佩戴耳机收听，收获独有的时刻）\n[00:18.635]是谁 是你 把眼泪 煮热\n[00:27.346]是谁 是我 把疼痛 加热\n[00:36.051]你坐在 红色 无边的 梦河\n[00:44.606]再没有 等来 接你 的我\n[00:53.583]风中 的你 穿得 很薄\n[01:02.080]是谁 从你 身旁 走过\n[01:11.160]好想 把你 从身后 捂热\n[01:19.460]却忘了 你我 隔着 山河\n[01:28.692]是等了很久 也还等不到 而沉默\n[01:37.382]是黑色与红色 总躲不掉 的重合\n[01:46.064]是能燃烧河流与你我的 野火\n[01:55.083]世有无望的福歌\n[01:59.491]亦有无望的祸责\n[02:03.914]远风吹着又吹过\n[02:08.021]吹不动这红色的河\n[02:14.383]\n[02:47.365]是写了这半生 总还写错 的副歌\n[02:55.936]是等了很久 也还等不到 而沉默\n[03:04.757]是黑色与红色 总躲不掉 的重合\n[03:13.173]是能燃烧 河流与你我的 野火\n[03:22.165]大雨吻湿了 吻湿了 火热\n[03:30.439]彼此摇晃着 摇晃着 交错\n[03:39.440]我们继续着 继续着 走着\n[03:47.930]终于 悄悄地 悄悄地\n[03:56.914]这样 悄悄地 悄悄地\n[04:05.331]就这样 悄悄地 悄悄地\n[04:14.064]就这样 悄悄地 悄悄地\n[04:18.703]飘摇 在这 红色的河\n[04:27.503]\n",
          },
          {
            id: 407450223,
            author: "李荣浩",
            title: "爸爸妈妈",
            url: "https://shuaigang.top/gsg/music/bbmm.mp3",
            pic: "https://p2.music.126.net/e-Uc6W3Kug-HFHJ5nvCUPg==/109951166562828988.jpg",
            lrc: "[00:00.000] 作词 : 李荣浩\n[00:00.922] 作曲 : 李荣浩\n[00:01.844] 编曲 : 李荣浩\n[00:02.766] 制作人 : 李荣浩\n[00:03.690]\n[00:19.900]我曾经很想知道\n[00:22.580]\n[00:23.090]同样的话要说多少次才好\n[00:27.650]\n[00:28.590]那些再三强调的老套\n[00:31.990]\n[00:32.500]长大了才知道是不是需要\n[00:37.260]\n[00:38.010]很少主动拥抱\n[00:40.750]就算为了自豪\n[00:43.340]腼腆的笑\n[00:45.410]要强而又低调\n[00:48.020]穿的布料\n[00:50.080]我赠送的外套\n[00:52.770]过时也不丢掉\n[00:55.730]\n[00:57.470]还是一样\n[00:59.520]太多理所应当让人觉得平常\n[01:05.250]\n[01:06.290]不算太小的房\n[01:08.860]冬暖夏凉的那间放着我的床\n[01:14.640]\n[01:15.610]歌颂这种平凡 一两句唱不完\n[01:20.880]恩重如山 听起来不自然\n[01:25.630]回头去看\n[01:27.680]这是说了谢谢\n[01:29.690]反而才亏欠的情感\n[01:33.690]\n[01:35.070]爸爸妈妈给我的不少不多\n[01:39.040]足够我在这年代奔波\n[01:41.860]足够我生活\n[01:43.600]年少的轻狂不能用来挥霍\n[01:48.340]也曾像朋友一样和我诉说\n[01:52.430]\n[01:53.770]爸爸妈妈总说经历的坎坷\n[01:57.680]是度过青春的快乐\n[02:02.390]这时候这个季节\n[02:04.610]又想起了这首歌\n[02:09.620]\n[02:26.880]还是一样\n[02:29.000]太多理所应当让人觉得平常\n[02:34.840]\n[02:35.660]不算太小的房\n[02:38.260]冬暖夏凉的那间放着我的床\n[02:44.140]\n[02:45.010]歌颂这种平凡 一两句唱不完\n[02:50.290]恩重如山 听起来不自然\n[02:54.910]回头去看\n[02:57.030]这是说了谢谢\n[02:59.240]反而才亏欠的情感\n[03:02.800]\n[03:04.450]爸爸妈妈给我的不少不多\n[03:08.240]足够我在这年代奔波\n[03:11.170]足够我生活\n[03:13.080]年少的轻狂不能用来挥霍\n[03:17.640]也曾像朋友一样和我诉说\n[03:21.680]\n[03:23.180]爸爸妈妈总说经历的坎坷\n[03:27.060]是度过青春的快乐\n[03:31.080]\n[03:31.790]这时候这个季节\n[03:34.080]又想起了这首歌\n[03:39.070]\n[03:42.030]爸爸妈妈给我的不少不多\n[03:45.840]足够我在这年代奔波\n[03:48.880]足够我生活\n[03:50.650]年少的轻狂不能用来挥霍\n[03:55.390]也曾像朋友一样和我诉说\n[04:00.120]\n[04:00.990]爸爸妈妈总说经历的坎坷\n[04:04.720]是度过青春的快乐\n[04:10.250]\n[04:11.800]这时候这个季节\n[04:14.080]又想起了这首歌\n",
          },
          {
            id: 1974443814,
            author: "赵雷",
            title: "我记得",
            url: "https://shuaigang.top/gsg/music/wjd.mp3",
            pic: "https://p1.music.126.net/FCWD6ibS2JK2B3QAnXuzwQ==/109951167805892385.jpg",
            lrc: "[00:00.00] 作词 : 赵雷\n[00:01.00] 作曲 : 赵雷\n[00:02.00] 编曲 : 赵雷\n[00:03.00] 制作人 : 赵雷\n[00:28.15]我带着比身体重的行李 游入尼罗河底  经过几道闪电  看到一堆光圈 不确定是不是这里\n[00:41.78]我看到几个人站在一起 他们拿着剪刀摘走我的行李 擦拭我的脑袋 没有机会返回去\n[00:54.05]\n[00:55.87]直到我听见一个声音 我确定是你\n[01:04.13]可你怎记得我\n[01:09.20]我带来了另界的消息 可我怎么告知你\n[01:17.94]注定失忆着相遇\n[01:22.15]\n[01:23.39]我记得这里是片树林 后面有个山坡 山坡上的枣树每当秋天到来 我们把枣装满口袋\n[01:37.27]我记得除了朋友我还 做过你的叔父 你总喜欢跟在我的屁股后面 只是为了那几个铜钱\n[01:50.96]我记得我们曾是恋人 后来战争爆发 你上战场后就再也没有回来 直到收不到你的信\n[02:04.54]我们总这样重复分离 却要重新开始 相互送别对方 说着来世再见 再次失忆着相聚\n[02:16.84]\n[02:18.54]呜 呜 呜 呜…\n[02:23.35]快来抱抱 快来抱抱我\n[02:31.68]呜 呜 呜 呜…\n[02:34.03]快来抱抱 快来抱抱我\n[02:41.30]\n[03:13.15]在路上我遇到了一位故去多年的人 她是如此年轻 扎着过肩马尾 露出和你一样的笑\n[03:26.78]她和我讲了很多关于你成长的故事 在星空另一端 思念从未停止 如同墓碑上的名字\n[03:39.23]\n[03:40.58]不要哭我最亲爱的人 我最好的玩伴 时空是个圆圈 直行或是转弯 我们最终都会相见\n[03:54.13]在城池的某个拐角处 在夕阳西下时 在万家灯火的某一扇窗纱里 人们失忆着相聚\n[04:06.47]\n[04:08.47]呜 快来抱抱 快来抱抱我\n[04:21.62]呜 快来抱抱 快来抱抱我 我终于找到你\n[05:03.42]呜 快来抱抱 快来抱抱我 我终于找到你\n[05:16.10]\n[05:18.08]\n[05:18.86] 电吉他 : 刘磊/谢星\n[05:19.65] 贝斯 : Damien Banzigou\n[05:20.44] 鼓 : Chris Trzcinski\n[05:21.22] 钢琴 : 姜伯虎\n[05:22.01] 打击乐 : 刘恒/Chris Trzcinski\n[05:22.80] 管风琴 : 赵雷\n[05:23.58] 口琴 : 赵雷\n[05:24.37] 和声 : 朱莉/旭东\n[05:25.16] 录音师 : 张俊\n[05:25.95] 混音师 : 时俊峰\n[05:26.73] 录音室 : 摩登天空/55TEC\n[05:27.52] 录音助理 : 陈彬彬/朱莉\n[05:28.31] 母带工作室 : Sterling Sound\n[05:29.09] 母带工程师 : Randy Merrill\n[05:29.88] 封面设计 : 韩东/小强/阿穆隆\n",
          },
          {
            id: 506259256,
            author: "夏日入侵企画",
            title: "夏末的歌",
            url: "https://shuaigang.top/gsg/music/xmdg.mp3",
            pic: "https://p2.music.126.net/cpnQotMbPUtodSjPdTqmKQ==/109951163025417959.jpg",
            lrc: "[00:00.00] 作词 : 灰鸿啊\n[00:01.00] 作曲 : 灰鸿啊\n[00:02.00] 编曲 : 夏日入侵企画\n[00:03.00] 词曲 : 灰鸿啊\n[00:04.00] 录音师 : 张明懂\n[00:05.00] 节奏吉他 : 皮皮\n[00:06.00] 主音吉他 : 肯尼\n[00:07.00] 混音师 : 朱增根\n[00:27.09]夏天过了你说想要远行\n[00:32.79]要旅行到什么地方\n[00:39.49]没说再见呢来日方长\n[00:45.09]真的不必太过感伤\n[00:51.64]夏天过了收到你的相片\n[00:57.40]又旅行到什么地方\n[01:04.00]感谢你的来信我的朋友\n[01:09.80]我会在这里\n[01:12.45]等你\n[01:15.48]经过狂欢的人群\n[01:21.58]看过无眠的灯火\n[01:27.68]愿意走完山海与星河\n[01:33.87]可是你\n[01:36.28]在哪里\n[01:41.03]夏天过了\n[01:42.88]还没你的消息\n[01:46.69]又旅行到什么地方\n[01:53.19]恨自己轻率又从容的道别\n[01:58.99]在你离开的时候\n[02:29.30]经过狂欢的人群\n[02:35.45]看过无眠的灯火\n[02:41.60]愿意走完山海与星河\n[02:47.70]可是你\n[02:50.10]在哪里\n[02:54.71]夏天过了还没你的消息\n[03:00.61]又旅行到什么地方\n[03:07.06]恨自己轻率又从容的道别\n[03:12.81]在你离开的时候\n[03:19.50]在你离开\n[03:21.84]的时候\n",
          },
          {
            id: 1811730373,
            author: "卢广仲",
            title: "刻在我心底的名字",
            url: "https://shuaigang.top/gsg/music/kzwxddmz.mp3",
            pic: "https://p2.music.126.net/_M7Vq5xv--ZVAQ71GIQXoQ==/109951167781186348.jpg",
            lrc: "[00:00.00] 作词 : 许媛婷/佳旺/陈文华\n[00:00.00] 作曲 : 许媛婷/佳旺/陈文华\n[00:00.00]制作人：郑国锋\n[00:10.81]编曲：邱凯辉\n[00:19.66]混音：赵卓鹏\n[00:33.78]Oublie-le\n[00:38.13]好几次我告诉我自己\n[00:45.22]越想努力赶上光的影\n[00:51.40]越无法抽离而已\n[01:01.95]Je t'aimais\n[01:06.35]刻骨铭心只有我自己\n[01:13.41]好不容易交出真心的勇气\n[01:19.38]你沉默的回应是善意\n[01:28.83]刻在我心底的名字\n[01:32.39]忘记了时间这回事\n[01:35.98]于是谎言说了一次就一辈子\n[01:42.96]曾顽固跟世界对峙\n[01:46.58]觉得连呼吸都是奢侈\n[01:51.14]如果有下次\n[01:52.97]我会再爱一次\n[01:57.06]刻在我心底的名字\n[02:00.58]你藏在尘封的位置\n[02:04.13]要不是这样我怎么过一辈子\n[02:11.20]我住在霓虹的城市\n[02:14.69]握着飞向天堂的地址\n[02:19.29]你可以翱翔\n[02:21.26]可是我只能停滞\n[02:30.09]寻找你\n[02:34.56]茫茫人海却又想起你\n[02:41.61]好不容易离开思念的轨迹\n[02:47.55]回忆将我联系到过去\n[02:57.09]刻在我心底的名字\n[03:00.59]忘记了时间这回事\n[03:04.17]既然决定爱上一次就一辈子\n[03:11.69]希望让这世界静止\n[03:14.71]想念才不会变得奢侈\n[03:20.26]如果有下次\n[03:21.76]我会再爱一次\n[03:25.30]刻在我心底的名字\n[03:28.77]你藏在尘封的位置\n[03:32.39]要不是这样我怎么过一辈子\n[03:39.39]我住在想你的城市\n[03:42.86]握着飞向天空的钥匙\n[03:47.58]你继续翱翔 还有我为你坚持\n",
          },
          {
            id: 1897934517,
            author: "古巨基",
            title: "Dear Leslie",
            url: "https://shuaigang.top/gsg/music/DearLeslie.mp3",
            pic: "https://p1.music.126.net/rEXR0jCHBpm9guzfBAZPLA==/109951166656460231.jpg",
            lrc: "[00:00.00] 作词 : Chen Shao Qi\n[00:01.00] 作曲 : 劉宏基\n[00:11.68]\n[00:17.00]Dear Leslie\n[00:23.72]我想知道你好吗\n[00:29.19]心仍然牵挂 情难自控\n[00:35.95]那绝代和永远芳华\n[00:39.80]\n[00:42.31]念著当年情\n[00:49.86]每首歌再细心倾听\n[00:55.57]多年来苦拼 沉默是天性\n[01:01.67]你就是永恆明星\n[01:06.23]\n[01:08.32]从画面寻回 时光的印记\n[01:14.64]回忆总停留下午三点记起\n[01:21.24]蜻蜓仍高飞 爱慕没放弃\n[01:27.75]多么想你 你在何地\n[01:32.53]\n[01:35.30]当风吹起某年某一刻不忍远离\n[01:40.93]期待转移时空宝荣耀辉又重遇故地\n[01:48.23]想起因你笑容与歌曾感动过\n[01:53.81]然后我 何用再得到更多\n[02:00.23]\n[02:01.15]当光影中再重播出经典的传奇\n[02:06.77]期待霸王重生悲情虞姬还会在献技\n[02:14.08]想起跟你某年某天曾经合照\n[02:19.76]年月有了你平凡却重要\n[02:24.95]\n[02:42.60]不改的沉迷\n[02:49.75]你的一切多么宝贵\n[02:55.50]当年如花俏 迷住十二少\n[03:02.09]看日落 曾照遍巴黎\n[03:06.30]\n[03:08.49]别后的流年\n[03:15.71]世间早有太多改变\n[03:21.47]冲绳无恋战 怀念流星语\n[03:27.93]你亦是永恆如昨天\n[03:32.74]\n[03:34.43]从画面寻回 时光的印记\n[03:40.85]回忆总停留下午三点记起\n[03:47.38]蜻蜓仍高飞 爱慕没放弃\n[03:53.86]多么想你 你在何地\n[03:59.33]\n[04:00.80]当风吹起某年某一刻不忍远离\n[04:06.40]期待转移时空宝荣耀辉又重遇故地\n[04:13.71]想起因你笑容与歌曾感动过\n[04:19.41]然后我 何用再得到更多\n[04:25.98]\n[04:26.65]当光影中再重播出经典的传奇\n[04:32.38]期待霸王重生悲情虞姬还会在献技\n[04:39.66]想起跟你某年某天曾经合照\n[04:45.37]年月有了你平凡却重要\n[04:51.92]没有脚的鸟 平静已睡了\n[05:01.92]\n[05:15.71]\n",
          },
          {
            id: 29775439,
            author: "Nirvana",
            title: "Seasons In The Sun",
            url: "https://shuaigang.top/gsg/music/SeasonsInTheSun.mp3",
            pic: "https://p2.music.126.net/U6hJgqXuFLEGkgJEMcoagg==/109951168229718877.jpg",
            lrc: "[00:02.110]Go Krist\n[00:13.750]Goodbye my friend its hard to die\n[00:18.750]when all the birds are singing in the sky\n[00:24.400]And all the flowers are everywhere\n[00:29.790]Pretty girls are everywhere\n[00:34.290]Think of me and I'll be there\n[00:43.690]Goodbye, Papa, please pray for me.\n[00:50.090]I was the black sheep of the family.\n[00:55.190]And I don't know the . all these words.\n[01:00.810]I have boggy turds.\n[01:06.100]With my B.B. gun I would kill birds.\n[01:11.260]We had joy. We had fun.\n[01:15.860]We had seasons in the sun,\n[01:18.610]but the hills that we climb\n[01:21.340]were just seasons out of time.\n[01:27.560]All our lives, we had fun.\n[01:30.420]We had seasons in the sun,\n[01:32.930]but the hill that we reached\n[01:35.300]were just starfish on the beach\n[01:44.110]Goodbye Michelle my little one\n[01:51.960]I was the apple of the shiny sun.\n[01:57.560]And la la la la hill we reach.\n[02:02.560]All my tears are salty.\n[02:07.870]I think now I was taught to weep.\n[02:14.840]We had joy. We had fun.\n[02:17.860]We had seasons in the sun,\n[02:20.380]but the hills that we climb\n[02:23.040]were just seasons out of time.\n[02:29.570]We had joy. We had fun.\n[02:32.290]We had seasons in the sun,\n[02:34.980]but the hill on the beach\n[02:37.780]were just starfish on the beach\n[02:44.120]We had joy. We had fun.\n[02:46.680]We had seasons in the sun,\n[02:49.250]but the hills that we climb\n[02:51.820]were just seasons out of time.\n[02:58.520]I've had joy. We had fun.\n[03:01.210]We had seasons in the sun,\n[03:03.810]but the stars that we reached\n[03:06.320]were just starfish on the beach\n",
          },
          {
            id: 21253903,
            author: "Maroon 5",
            title: "Goodnight Goodnight",
            url: "https://shuaigang.top/gsg/music/GoodnightGoodnight.mp3",
            pic: "https://p2.music.126.net/Lfrhyy1Lo4RdMobJW6RY2Q==/109951166055616070.jpg",
            lrc: "[00:00.00] 作词 : Adam Levine\n[00:01.00] 作曲 : Adam Levine\n[00:10.89]You left me hanging from a thread\n[00:13.34]We once were from together\n[00:15.69]I lick my wounds but I can\n[00:17.90]Never see them getting better\n[00:20.30]Something's gotta change\n[00:22.85]Things cannot stay the same\n[00:25.75]Her hair was pressed against her face\n[00:28.51]Her eyes were ran with anger\n[00:30.86]Enraged by things unsaid\n[00:32.97]And empty beds and bad behaviour\n[00:35.51]Something's gotta change\n[00:38.12]It must be rearranged oh\n[00:42.92]I'm sorry I did not mean\n[00:48.02]To hurt my little girl\n[00:52.93]It's beyond me I cannot carry\n[00:58.23]The weight of a heavy world\n[01:02.38]So goodnight goodnight goodnight goodnight\n[01:08.09]Goodnight goodnight goodnight goodnight\n[01:13.34]Goodnight hope that things work out all right yeah\n[01:23.04]Whoa oh\n[01:29.09]The room was silent as we\n[01:31.14]All tried so hard to remember\n[01:34.04]The way it feels to be alive\n[01:36.74]The day that he first met her\n[01:38.79]Something's gotta change\n[01:41.19]Things cannot stay the same\n[01:44.29]You make me think of someone wonderful\n[01:47.25]But I can't place her\n[01:49.25]I wake up every morning\n[01:51.35]Wishing one more time to face her\n[01:53.90]Something's gotta change\n[01:56.45]It must be rearranged oh\n[02:01.50]I'm sorry I did not mean\n[02:06.20]To hurt my little girl\n[02:11.30]It's beyond me I cannot carry\n[02:16.55]The weight of a heavy world\n[02:20.85]So goodnight goodnight goodnight goodnight\n[02:26.10]Goodnight goodnight goodnight goodnight\n[02:31.21]Goodnight hope that things work out all right\n[02:37.86]So much to love\n[02:39.26]So much to learn\n[02:41.46]But I won't be there to teach you oh\n[02:47.67]I know I can be close\n[02:51.62]But I try my best to reach you\n[02:55.57]I'm so sorry I did not mean\n[03:01.87]To hurt my little girl\n[03:06.22]It's beyond me I cannot carry\n[03:12.07]The weight of a heavy world\n[03:15.82]So goodnight goodnight goodnight goodnight\n[03:21.77]Goodnight goodnight goodnight goodnight\n[03:27.08]Goodnight goodnight goodnight goodnight\n[03:31.73]Goodnight hope that things work out all right yeah\n[03:42.13]Whoa oh…Yeah…\n",
          },
          {
            id: 1981587929,
            author: "黑裙子",
            title: "Min (미는 남자)",
            url: "https://shuaigang.top/gsg/music/Min.mp3",
            pic: "https://p2.music.126.net/UCpvmCqV-dn1YO10rMWPgA==/109951167879559042.jpg",
            lrc: "[00:00.000] 作词 : 黑裙子\n[00:01.000] 作曲 : 黑裙子\n[00:30.022]민 너는 나의 미는 남자\n[00:36.747]이맘때 난 항상 전화를 해\n[00:44.391]민 니가 연락이 안되면 나는\n[00:52.189]무작정 너의 집을 찾아가\n[00:59.413]민 너의 어두운 창문에\n[01:06.778]늘 하던대로 노크를 해\n[01:14.342]민 너의 발소리가 들려 그럼\n[01:22.449]내 마음도 부풀어 오르지\n[01:44.350]너 없이는 내 하루가 길고\n[01:48.544]너 없이는 나는 재미없고\n[01:52.525]빈손으로도 널 볼 순 있지만\n[01:57.037]그런적은 없었지\n[01:59.654]민 너의 방안엔 오늘도\n[02:06.833]온갖 쓰레기가 모여있어\n[02:14.477]민 내가 어쩌면 그중에 제일\n[02:21.895]크고 오래된 것 같아\n[02:29.566]민 나는 한번도 안 밀려\n[02:36.705]여유가 있어서가 아니야\n[02:44.521]민 우리 약속이 먼저야\n[02:51.835]알잖아 나는 내일 또 올꺼야\n[02:59.924]Min, min, min, my man\n[03:03.391]Min my man, you are my main man\n[03:07.472]Min, min, you are my main man\n[03:14.456]Min, min, min, my man\n[03:18.378]Min my man, you are my main man\n[03:22.398]Min, min, you are my main man\n[03:29.692](굵게 말은 더치는 시계방향으로)\n[03:37.111](굵게 말은 더치는 시계방향으로)\n[03:44.510](굵게 말은 더치는 시계방향으로)\n[03:52.286](굵게 말은 더치는 시계방향으로)\n",
          },
          {
            id: 28999945,
            author: "The Midnight",
            title: "Los Angeles",
            url: "https://shuaigang.top/gsg/music/LosAngeles.mp3",
            pic: "https://p2.music.126.net/LJgc0F-6JEJn_QgCJaE_WA==/109951167481008171.jpg",
            lrc: "[00:00.00] 作词 : Tyler Lyle/Tim McEwan\n[00:01.00] 作曲 : Tyler Lyle/Tim McEwan\n[00:33.32]Fire on the beach\n[00:36.47]\n[00:37.68]Face to the sky\n[00:40.46]\n[00:41.14]The stars dance around like gods in the skies\n[00:48.60]\n[00:49.83]The gold silhouette\n[00:52.88]\n[00:53.60]You take off your clothes\n[00:57.37]\n[00:57.80]And my heart feels the weight of all I don't know\n[01:03.78]\n[01:06.37]Memories and mountain tops\n[01:09.47]\n[01:10.52]Drunk on Sunset Boulevard\n[01:13.51]\n[01:14.67]With the city of angels singing on\n[01:20.92]\n[01:22.89]Maybe this is just a dream\n[01:25.87]\n[01:26.57]And maybe we are still asleep\n[01:30.21]\n[01:30.40]But I, I will miss you when I'm gone\n[01:36.92]\n[01:40.17]Flickers of the canyon fire\n[01:44.86]Its hands raised like a gospel choir\n[01:48.23]\n[01:48.54]If we live forever, let us live forever tonight\n[01:52.84]\n[01:56.05]Helicopters against moonlight\n[02:00.00]\n[02:00.16]Our holy mother of the midnight\n[02:04.20]\n[02:04.39]And if we live forever, let us live forever tonight\n[02:11.31]\n[02:13.84]Tomorrow we'll go\n[02:17.07]\n[02:18.18]Back to our lives\n[02:21.43]\n[02:22.10]With sand in our skin and sun in our eyes\n[02:27.84]\n[02:30.47]But I know the truth\n[02:33.67]\n[02:34.06]I've seen the signs\n[02:37.71]\n[02:38.10]And I've seen the golden gods in disguise\n[02:44.34]\n[02:46.86]Memories and mountain tops\n[02:50.96]Drunk on Sunset Boulevard\n[02:54.89]\n[02:55.00]With the city of angels singing on\n[03:01.67]\n[03:03.46]Maybe this is just a dream\n[03:07.00]\n[03:07.43]And maybe we are still asleep\n[03:11.52]\n[03:11.76]But I, I will miss you when I'm gone\n[03:17.71]\n[03:20.89]Flickers of the canyon fire\n[03:24.24]\n[03:24.55]Its hands raised like a gospel choir\n[03:28.19]\n[03:28.38]If we live forever, let us live forever tonight\n[03:33.51]\n[03:37.27]Helicopters against moonlight\n[03:41.07]\n[03:41.44]Our holy mother of the midnight\n[03:46.67]And if we live forever, let us live forever tonight\n[03:50.95]\n[03:52.14]Flickers of the canyon fire\n[04:28.05]Its hands raised like a gospel choir\n[04:35.60]\n[04:36.08]If we live forever, let us live forever tonight\n[04:42.29]\n[04:43.91]Helicopters against moonlight\n[04:47.97]\n[04:48.60]Our holy mother of the midnight\n[04:51.94]\n[04:52.10]And if we live forever, let us live forever tonight\n[04:57.26]\n[05:01.04]Flickers of the canyon fire\n[05:04.32]\n[05:04.46]Its hands raised like a gospel choir\n[05:08.47]\n[05:08.72]If we live forever, let us live forever tonight\n[05:13.92]\n[05:17.67]Helicopters against moonlight\n[05:20.97]\n[05:21.13]Our holy mother of the midnight\n[05:25.26]\n[05:25.41]And if we live forever, let us live forever tonight\n[05:32.54]\n",
          },
          {
            id: 1957783310,
            author: "徐佳莹",
            title: "在意这件事",
            url: "https://shuaigang.top/gsg/music/zyzjs.mp3",
            pic: "https://p2.music.126.net/LkwTIyU7Zo853W6LUfYpag==/109951167574776183.jpg",
            lrc: "[00:00.00] 作词 : 葛大为\n[00:01.00] 作曲 : 徐佳莹/陈君豪\n[00:12.00]在对的时间\n[00:15.63]说错了话\n[00:19.17]你也习惯我了吧\n[00:25.91]\n[00:25.92]还没有到家\n[00:29.64]太多想象\n[00:33.15]不跳舞的星期天\n[00:38.36]\n[00:38.37]等咖啡 等失眠\n[00:42.72]等你想聊天\n[00:45.33]等好久 等不见\n[00:49.59]词穷的瞬间\n[00:52.04]\n[00:52.05]我等等等\n[00:54.06]等等等\n[00:56.61]这样在意着\n[01:01.59]我都变坏了\n[01:14.66]\n[01:14.67]在错的时间\n[01:18.36]怎么表达\n[01:21.78]才能扳回一城呢\n[01:28.49]\n[01:28.50]你会开心吗\n[01:32.28]你的名字\n[01:35.79]被我唱成一首歌\n[01:41.00]\n[01:41.01]等红灯 等悠闲\n[01:45.36]等他没时间\n[01:47.91]等例外 等有天\n[01:52.20]永恒的对眼\n[01:54.62]\n[01:54.63]我在意着\n[01:56.58]在意着\n[01:59.25]不小心变成\n[02:04.23]你讨厌的人\n[02:33.14]\n[02:33.15]等红灯 等悠闲\n[02:37.50]等他没时间\n[02:40.08]等例外 等有天\n[02:44.37]永恒的对眼\n[02:46.82]\n[02:46.83]我在意着\n[02:48.78]在意着\n[02:51.42]不小心变成\n[02:56.43]你讨厌的人\n[03:00.71]\n[03:00.72]我在意着\n[03:02.67]在意着\n[03:05.37]不小心变成\n[03:10.32]我讨厌的人\n[03:11.43] 制作人 Producer：徐佳莹 LaLa Hsu / 陈君豪 Howe@成绩好工作室\n[03:12.55] 编曲 Arrangement：张晁毓 Dato Chang / 陈君豪 Howe\n[03:13.67] \n[03:14.79] 钢琴&风琴&美乐特朗电子琴 Piano&Organ&Mellotron：张晁毓 Dato Chang\n[03:15.91] 木吉他 Acoustic Guitar：董运昌 Yun-Chang Dong / 陈君豪 Howe\n[03:17.02] 贝斯 Bass：陈君豪 Howe\n[03:18.14] \n[03:19.26] 录音师 Recording Engineer：叶育轩 YuHsuan Yeh  / 沈冠霖 SHENB\n[03:20.38] 录音室 Recording Studio : BB Road Studio\n[03:21.50] 混音师 Mixing Engineer：陈君豪 Howe\n[03:22.61] 混音录音室 Mixing Studio：Nowhere Studio\n[03:23.73] 制作助理 Production Assistant：沈冠霖 SHENB / 林颉 Jie Lin\n",
          },
          {
            id: 1452439191,
            author: "李荣浩",
            title: "在一起嘛好不好",
            url: "https://shuaigang.top/gsg/music/zyqmhbh.mp3",
            pic: "https://p1.music.126.net/JzsER44sOReoM6mR8XKnsw==/109951165182029540.jpg",
            lrc: "[00:00.000] 作词 : 李荣浩\n[00:00.398] 作曲 : 李荣浩\n[00:00.796] 编曲 : 李荣浩\n[00:01.194] 制作人 : 李荣浩\n[00:01.595]\n[00:24.572]翻聊天记录等信息等着你回  困也不睡\n[00:36.844]昨天说我讨厌今天准时赴约  还嘟着嘴\n[00:47.673]该死的世界  是不是了解\n[00:55.009]被巷子里的灯照着的你好美\n[00:59.871]我牵你手就走  你生气却没有 松开手\n[04:04.592][01:12.475]我们在一起嘛好不好\n[04:10.786][01:18.721]我们在一起嘛好不好\n[04:18.862][01:26.574]昨天我说最喜欢的女孩子的性格\n[04:26.454][01:34.200]是你的\n[04:29.168][01:36.964]我们在一起嘛好不好\n[04:35.384][01:43.174]我们在一起嘛好不好\n[04:43.454][01:51.185]也许我话不会说也是一种深刻\n[02:01.523]在一起嘛好不好\n[02:27.798]以后的晚餐不再坐你对面  只坐你身边\n[02:39.860]最甜的爆米花放在最上面  你拿着方便\n[02:50.708]不懂怎么哄你  是因为我可以\n[02:58.051]一开始就不会让你感到生气\n[03:02.946]绝不会让你  受半点的委屈  我可以\n[03:15.551]我们在一起嘛好不好\n[03:21.595]我们在一起嘛好不好\n[03:29.753]昨天我说最喜欢的女孩子的性格\n[03:37.213]是你的\n[03:39.845]我们在一起嘛好不好\n[03:46.138]我们在一起嘛好不好\n[03:54.330]也许我话不会说也是一种深刻\n[04:53.927]在一起嘛好不好\n[04:55.709]\n[04:58.356]\n[04:58.396] 吉他 : 李荣浩\n[04:58.436] 贝斯 : 李荣浩\n[04:58.476] 和声编写 : 李荣浩\n[04:58.516] 和音 : 李荣浩\n[04:58.556] 录音师 : 李荣浩\n[04:58.596] 混音师 : 李荣浩\n[04:58.636] 音乐制作助理 : 青格乐\n[04:58.676] 录音工作室 : 北京一样音乐录音室\n[04:58.716] 混音室 : 北京一样音乐录音室\n[04:58.756] 母带制作 : 李荣浩\n[04:58.796] 母带工程师 : 周天澈\n[04:58.836] 母带后期处理录音室 : Studio21A\n",
          },
          {
            id: 29122797,
            author: "莫西子诗",
            title: "妈妈的歌谣",
            url: "https://shuaigang.top/gsg/music/mmdgy.mp3",
            pic: "https://p2.music.126.net/GpLT2444p7gnCSxGRSMmPw==/6632254138997594.jpg",
            lrc: "[00:09.731](黄昏的时候 )\n[00:15.530](ip ip)\n[00:18.325](看着天空回想故乡)\n[00:26.893](妈妈已做好今晚 最丰盛的晚餐 )\n[00:30.524](山河有回旋的时候)\n[00:34.965](妈妈的思念)\n[00:38.648](和那流水一样多)\n[00:43.585](hxi ip)\n[00:46.093](为何在山岗等待孩子)\n[00:52.519](hxi 回来  回来  回来)\n[00:59.703](ip hxox)\n[01:08.428]\n[01:46.488](天黑了)\n[01:50.145](思念如那山间的鸟儿)\n[01:54.351](从那山间飞来)\n[01:58.269](和那流水一样多)\n[02:03.024]\n[02:05.322](为何带着这么多的忧伤)\n[02:11.435](hxi  回来  回来  回来)\n[02:18.723](hxi  hxox)\n[02:23.660]\n[02:30.295](流水哦  你一路匆匆)\n[02:35.677](要去哪里)\n[02:43.069](为何带着这么多的忧伤)\n[02:47.667](妈妈)\n[02:52.238](我愿是你脚下的每一寸土)\n[02:56.000](让你轻轻)\n[03:01.773](踩在我背上)\n[03:09.584]",
          },
          // {
          //   id: 1,
          //   author: "",
          //   title: "",
          //   url: "",
          //   pic: "",
          //   lrc: "",
          // },
          // {
          //   id: 1,
          //   author: "",
          //   title: "",
          //   url: "",
          //   pic: "",
          //   lrc: "",
          // },
          // {
          //   id: 1,
          //   author: "",
          //   title: "",
          //   url: "",
          //   pic: "",
          //   lrc: "",
          // }
        ];
        // for (let i = 0; i < state.myMusicList.length; i++) {
        //   let m = state.myMusicList[i];
        //   await getSongUrl({ id: m.id }).then((res: any) => {
        //     if (res.code === 200) {
        //       m.url = res.data[0].url;
        //     } else {
        //       console.log("url获取异常；");
        //     }
        //   });
        // }
        nextTick(() => {
          state.audioList = state.myMusicList.map(
            (value: any) =>
              new Audio(
                // 歌手
                value.author,
                // 歌名
                value.title,
                // 播放地址
                value.url,
                // 图片地址
                value.pic,
                // 歌词地址
                value.lrc
              )
          );
          methods.init();
          methods.watchLocalStorage();
        });
      },
    };

    // 初始化
    onMounted(() => {
      methods.setMyMusicList();
      // nextTick(() => {
      //   state.audioList = state.myMusicList.map(
      //     (value: any) =>
      //       new Audio(
      //         // 歌手
      //         value.author,
      //         // 歌名
      //         value.title,
      //         // 播放地址
      //         value.url,
      //         // 图片地址
      //         value.pic,
      //         // 歌词地址
      //         value.lrc
      //       )
      //   );
      //   methods.init();
      //   methods.watchLocalStorage();
      //   // 默认推荐100首
      //   // getAudioList({
      //   //   server: props.songServer,
      //   //   type: props.songType,
      //   //   id: props.songId,
      //   //   r: Math.random(),
      //   // }).then((res: any) => {
      //   //   state.audioList = res.map(
      //   //     (value: any) =>
      //   //       new Audio(
      //   //         // 歌手
      //   //         value.author,
      //   //         // 歌名
      //   //         value.title,
      //   //         // 播放地址
      //   //         value.url,
      //   //         // 图片地址
      //   //         value.pic,
      //   //         // 歌词地址
      //   //         value.lrc
      //   //       )
      //   //   );
      //   //   methods.init();
      //   // });
      // });
    });
    // 销毁
    onBeforeUnmount(() => {
      ap.destroy();
    });
    return { Audio, ...toRefs(state), ap, playerRef, ...methods };
  },
});
</script>
<style scoped></style>
